{"text": "Here are the main points: - The new treatment plan has been delayed due to a supply issue. - We need to reschedule the medication dosage change. - The original timeline was two weeks, but it might extend by another week. - I've tried contacting the supplier twice, but no update yet. - We'll notify you once we have confirmation.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 1}
{"text": "Quick question: I sent a referral request to Dr. Smith last week, but haven't received a response yet. Is there any update on when they might accept new referrals?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 2}
{"text": "On the patient portal, the status shows that my recent persistent pain consultation has been rescheduled several times, and I'm still waiting for a new appointment date to be confirmed. The last update indicated a delay due to staff availability, but it's unclear when exactly this might resolve. I've tried checking multiple times, but the portal keeps showing the same outdated information, making it difficult to plan around. I need to ensure I have all necessary documentation ready when the appointment finally comes through.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 3}
{"text": "The pharmacist mentioned that there was a delay in processing the insurance claim, and I'm not clear on who is responsible for paying the remaining balance. They said it might take a few days, but I'm still waiting and unsure what to do next.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 4}
{"text": "Following up on the request from last week, I'm calling again because the appointment for the new symptoms hasn't been scheduled despite multiple attempts. The case number is 4528.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 5}
{"text": "I'm following up for my elderly relative who has mobility issues. They called yesterday to cancel their upcoming appointment, but the time was short for rescheduling. I've tried multiple times to reach the office to get a new date, but the receptionist is unavailable and the online system is down. The caregiver needs a specific specialist, and we're running out of time due to their medical condition. I need to get this resolved quickly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 6}
{"text": "Last Thursday, I had my routine check-up with the doctor, and they mentioned something about my imaging results needing further review. I've been trying to get a clearer picture since then, but it feels like I'm spinning my wheels. I called the office on Monday to follow up, and they said they were looking into it, but I didn't hear back until yesterday when they told me they needed another specialist to take a second look. Now I'm waiting for that specialist to review everything, and it's been longer than expected. I just want to understand what's going on with my test results, but every time I ask, the timeline keeps shifting. It's hard to keep track of everything without a clear schedule.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 7}
{"text": "The pharmacist mentioned that my mom's prescription renewal has been delayed due to a clerical error at the pharmacy, and they are still waiting on confirmation from the prescribing doctor. At the front desk they told me they've already tried contacting the doctor twice this week, but haven't received a response yet. I asked if they could expedite it or use an older prescription, but they said that won't work until the renewal goes through.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 8}
{"text": "Need clarification: I'm having trouble with the instructions for taking the new medication. The portal says to take it twice daily, but I called the office and they said once daily. Which is correct?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 9}
{"text": "To clarify, I tried to reschedule the appointment twice but received no response from the office. My work schedule has changed unexpectedly, so I need to cancel the upcoming visit.  I've checked my email several times but didn't see any confirmation or alternative date options.  Could someone please re-send the necessary details or confirm if the cancellation process is still pending?  I also need to know by when the insurance claim should be submitted to avoid any issues.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 10}
{"text": "Re: the issue from my last call, I'm still waiting on the results for my recent blood test from June 15th. I called earlier about it and was told someone would contact me, but I haven't heard back yet. The doctor's office mentioned they were looking into it, but I'm not sure what that means exactly. I need to know when I can expect this.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 11}
{"text": "I'm following up for my elderly relative who is waiting for referral approval. Their condition has stabilized, but the process is taking longer than expected. We need clarification on the next steps.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 12}
{"text": "Since my appointment earlier this month, I've been carefully following the instructions for my new medication. The doctor mentioned it could cause some gastrointestinal discomfort, which I've been experiencing off and on. Last week, I called the clinic to report this, and they suggested I take an over-the-counter antacid with it. Yesterday, I did that, but the symptoms have persisted and even included mild nausea. I've been keeping a log of when it happens and what I've eaten, but I'm still unsure if there's a pattern. I've also noticed some fatigue that wasn't mentioned as a side effect. It's been difficult to manage my schedule around feeling unwell, and I haven't been able to figure out if the medication is the cause or something else. I'm trying to stick to the dosage but it's challenging when I'm not sure what to expect.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 13}
{"text": "The portal record for my visit shows that the medication refill for my hypertension was supposed to be available by yesterday, but it's still pending. I checked the status again today, and it's unchanged. They mentioned it might be delayed due to supply issues, but I haven't received any further updates. I need this by tomorrow for my follow-up appointment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 14}
{"text": "The nurse said, \"Could you clarify what time I need to take the second pill?\" I'm not sure if it's after lunch or before dinner.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 15}
{"text": "What happened: I submitted my insurance claim for the last quarter on October 15th. To clarify: They sent a letter saying the claim was denied due to missing documentation. Details: I have resubmitted the required forms twice already, but haven't received a response.  ", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 16}
{"text": "I'm following up for my mother-in-law, who is in her late 70s and relies on specific pharmacies for refills. The prescription was sent to the wrong location yesterday, and I've been trying to coordinate with the pharmacy chain for clarification. They mentioned it could be due to a system update, but the redirect process is unclear, and there's still no update on when it will be corrected. I'm calling because we need to ensure she gets her medication without further delays, but I haven't received a clear timeline from anyone.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 17}
{"text": "On the patient portal, the status shows that the repeat prescription needs to be resubmitted because the pharmacy is missing the blood pressure monitor. I've sent the order again this morning.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 1}, "id": 18}
{"text": "Re: the issue from my last call, I'm still waiting for the referral to be processed. I called yesterday and was told it would be completed by today, but as of now, it's not in the system. This delay is causing issues with scheduling my appointment.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 19}
{"text": "I'm following up on the patient portal access issue. The required documents were supposed to be available by yesterday, but they're still missing. I've already contacted the support team twice and haven't received any update. This is causing significant delays in updating the records, and we need to resolve this urgently to meet the deadline for the next appointment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 20}
{"text": "Last Thursday, I started noticing some unusual symptoms with my father's blood pressure that doesn't seem to align with his usual patterns. The readings are fluctuating more than expected, and I've been diligently logging them each morning and evening. Yesterday, after discussing with his home nurse, we realized that the device he's using might not be calibrated correctly, which could explain the inconsistencies. I've been double-checking the device settings and comparing the readings against a manual monitor, but there's still no clear resolution. The doctor's office has been slow to respond, and I'm now trying to figure out if we need to schedule an urgent appointment or if we should continue monitoring until the next scheduled check-up. This is particularly challenging because we're trying to manage his condition without any clear guidance.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 21}
{"text": "The portal now says my prescription was sent to the wrong pharmacy yesterday, but I don't see any update on when it will be corrected.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 22}
{"text": "One issue: I've been trying to get my prescription renewed for a month now and it's still not processed. I called yesterday and they said they were checking, but I haven't heard back by today's deadline. Need clarification on what's causing the delay.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 23}
{"text": "Details: My mother's symptoms started again two days after her last treatment. She tried taking the prescribed medication as instructed, but it didn't help. She called yesterday, but the nurse was unavailable. We're calling now because we need a new prescription today. We're stuck without clear guidance.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 24}
{"text": "About the referral noted in my chart, I just received the results for my blood test from May 15th. They look good, and the doctor has already sent me a follow-up note.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 25}
{"text": "Last Thursday, I contacted the scheduling office to book a follow-up appointment for my mother, but they informed me that all slots for the next two weeks are filled. I tried again yesterday, but the availability remains the same. The office mentioned there might be an opening in the following month, which feels like an eternity given her condition. I've been trying to coordinate this for several days now, and it's becoming increasingly difficult to manage her care without a timely appointment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 26}
{"text": "I'm reaching out for my spouse regarding the follow-up appointment that was supposed to take place last week. Due to unforeseen circumstances at the hospital, it has been delayed, and I've been trying to get clarification on the new date without success. My spouse is elderly and relies on me to manage these details, which has made it challenging to coordinate care for him. I've followed up twice already, but I haven't received a definitive update, and this lack of resolution is causing issues with his treatment plan.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 27}
{"text": "The receptionist told me I need to send another copy of my ID because they lost the one in the portal. What should I do?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 28}
{"text": "I'm reaching out for my spouse who is 78 years old. He had his blood tests done last Tuesday, but we haven't received the results yet. The doctor mentioned they would be available within two weeks, but it's now been five days and we're still waiting. I wanted to check if there was any update or if we need to follow up with the lab.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 29}
{"text": "To clarify,  We need to cancel the appointment at the pharmacy for Mrs. Johnson.  We tried calling twice yesterday but got voicemail both times.  We need to know the correct date and time for the next scheduled visit.  We’re unable to confirm the rescheduled appointment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 30}
{"text": "This started about a week ago when I began experiencing chest tightness again. I had been feeling much better since my last treatment, but now it's returning. Last week I tried to get in touch with my doctor's office, but they were unable to respond until yesterday, and even then, the advice was vague. I've been following their instructions, but the symptoms keep coming back. It's difficult to manage without clear guidance.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 31}
{"text": "I checked the portal this morning and noticed that the specialist I was hoping to see for my ongoing knee issues hasn't accepted the referral from my primary care physician yet. It's been over a week now, and I'm trying to understand why there's still no update. I've looked through the portal messages multiple times, but there's no explanation from the specialist's office. I need to get this sorted quickly because my symptoms haven't improved and I'm running out of time before my current treatment options expire.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 32}
{"text": "During the call, I was told my prescription was ready, but the pharmacist mentioned it was sent again because of a missing label. I'm still waiting and it's been three days now.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 33}
{"text": "In reference to the appointment change on August 15th, I wanted to follow up about the medication adjustment. The pharmacy is having trouble accessing the updated prescription because the case number 782 is not matching up with our records. Could you please confirm the correct case number or provide the prescription details again? We need to get this sorted before the next scheduled refill.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 34}
{"text": "One issue: I'm calling because the discharge instructions were unclear about when to follow up. I called earlier but didn't get a clear answer, so I'm trying again now.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 35}
{"text": "Summary: Claim was denied by insurance for the last visit. What happened: I submitted the appeal letter yesterday. Details: Provider office informed me they are rechecking the claim details. Status: They said they will contact me again by Friday. Resolution: I need to provide additional documentation if requested.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 36}
{"text": "This started about a week ago when I submitted the referral for my daughter's new medication to the pharmacy. The pharmacy called yesterday saying they couldn't process it because the referral was sent incorrectly. I immediately contacted the clinic to get a corrected copy, but they haven't been able to resend it yet. There's an important deadline tomorrow for the medication to be approved, and I'm stuck waiting for this new referral. I've already tried calling the pharmacy twice, and they keep saying they'll update me when they receive the corrected referral. It's been a week since the initial referral was sent, and now we're facing this deadline crunch. I'm just trying to get this resolved as quickly as possible.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 37}
{"text": "The pharmacist mentioned that the doctor's office called to reschedule, but I haven't received any new appointment time. I tried calling back earlier, but the receptionist couldn't provide details either. They said the delay is due to a scheduling issue, but I'm still waiting.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 38}
{"text": "One issue: I sent the email about the appointment reschedule on Monday, but haven't received a response yet. I need to know if it's still available or if I should book another time.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 39}
{"text": "The portal record for my visit shows the test results are still pending, and they expect it to be available by next week. I need to know when exactly it will be ready, as I have other arrangements to make.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 40}
{"text": "Following up on the request from last week, I wanted to clarify the medication adjustment for my chronic condition. The pharmacy called yesterday about the dosage change, but I didn't get the details. Now, the refill is due, and I'm still waiting on the updated instructions. I need to know exactly what to do with the old medication before I proceed, but no one has provided a clear timeline. I also have another appointment scheduled for next month, and I'm trying to coordinate everything without missing a step. Could you please confirm what the next steps are and provide the necessary information by Friday to avoid any delays?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 41}
{"text": "I'm reaching out for my spouse regarding the patient portal. I've been trying to submit the required forms for the last two weeks, but there are still missing documents that haven't been specified. The portal keeps updating the list, but I can't figure out what's needed next. There's a deadline looming, and I'm stuck on this issue without clear direction.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 42}
{"text": "In my portal messages, I can see that my insurance claim was denied, and I've already called twice to get help, but still haven't received a resolution by today's deadline.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 43}
{"text": "About the referral noted in my chart, I'm still having trouble understanding why my current medication dosage isn't aligning with the new guidelines from the specialist. I called yesterday, but the instructions about adjusting the dose were unclear. Could you clarify when and how to change it, especially since my symptoms haven't stabilized yet?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 44}
{"text": "The receptionist told me they're fully booked until next week, but I've already tried scheduling twice before, and it's been delayed each time.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 45}
{"text": "Need clarification: The patient has completed their treatment but received no follow-up instructions. They are unsure about next steps and when to schedule a check-up. Could you please provide guidance on post-care plans and timelines?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 46}
{"text": "I'm contacting you for my mother regarding the referral form that was sent to the pharmacy. It seems like there might be an issue with the information provided. The form was supposed to include her exact birthdate, but what we received doesn't have that detail at all. I've tried to contact the referring doctor's office twice now, and they're still waiting on some records from another facility. Meanwhile, the pharmacy is insisting that they need the correct details before they can process the medication. This is causing a significant delay in getting her the treatment she needs, and it's unclear when everything will be resolved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 47}
{"text": "Following up on the request from last week, I wanted to let you know that we're still working on scheduling your appointment for the 25th. There seems to be some confusion about the availability, and I'm a bit frustrated that it's taking longer than expected. Let me know if you have any questions about case number 789456.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 48}
{"text": "Following up on the request from last week, I'm still having issues with my persistent pain management. I scheduled a refill on October 15th, but I haven't received any updates. I'm confused about why there's a delay and frustrated that my pain isn't being addressed properly. Could you please check the status of my refill request?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 49}
{"text": "Following up on the request from last week, I'm still confused about the medication instructions for the refill. The case number is 12345, and I've been trying to figure this out for three days now. I'm really disappointed and frustrated because my mom relies on these meds, and I can't seem to get a clear answer. Maybe we can schedule a call to discuss this sooner?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 50}
{"text": "Summary: I wanted to let you know that some symptoms are returning after my treatment.  Details: I've been feeling more fatigued and occasional pain at the site.  Here are the main points: I'm concerned about this because the treatment seemed to help before.  I'm reaching out to schedule a follow-up appointment soon.  ", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 51}
{"text": "I'm contacting you for my mother regarding her medication. She's been experiencing severe dizziness and nausea since starting the new dosage last week. I'm confused about why this is happening and worried she might be having an adverse reaction. The doctor wasn't very clear during our last call, and I feel disappointed that we're still dealing with this after months of struggling with her condition. I'm anxious about her well-being and hoping you can provide some clarity soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 52}
{"text": "We're experiencing long wait times for prescription refills.  I'm anxious about delays in getting my medication.  The process is confusing and takes too long.  This frustrates me as my condition requires timely access.  I need to schedule this urgently.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 53}
{"text": "I checked the portal this morning and noticed that my recent blood test results are still pending, but I'm supposed to come back for repeat testing in two weeks. I'm confused because the doctor mentioned the results would be available sooner. Also, my case number is 789-45-6789, and I'm trying to understand why the test needs to be repeated now. The portal doesn't show any explanation or reason for this, which is worrying. I'm feeling quite anxious about it all.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 54}
{"text": "I'm messaging for a family member in my care. I'm disappointed to say that we're still waiting for their delayed lab results, and it's been over a week now. I'm just hoping there's an update soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 55}
{"text": "Last Thursday, I called the clinic to follow up on my referral for physical therapy. They assured me they had sent it correctly. But now, I'm calling again because I haven't received anything, and my appointment is in two weeks. I'm really angry because this is the second time they've sent it incorrectly. The first time was three months ago, and it took a week to fix. This time, they're saying it's delayed in transit, but I doubt that since I checked the portal and nothing shows. I'm worried about my recovery slipping away, and it's frustrating that they can't get this right. I need to schedule another call to get this sorted.  I'm disappointed that this isn't the first mistake, and I feel like they're not taking my concerns seriously enough.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 56}
{"text": "Need clarification: I'm calling regarding the referral approval delay. When will it be processed? I'm confused and frustrated about the timeline.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 57}
{"text": "Details: I've been waiting for over a month for my test results, and I'm becoming increasingly anxious about my symptoms. My primary care physician hasn't been available to discuss interim concerns, leaving me confused about the next steps. I called the clinic last week, but the referral to a specialist is still pending, which feels like an unending cycle. I'm frustrated by the lack of communication and hope for a clearer timeline from the practice. ", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 58}
{"text": "Quick question: The recent imaging results were unclear. Could you provide more details or clarification on what this might mean for my mother's condition? I'm feeling quite anxious about it.  Thanks, [Caregiver Name]", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 59}
{"text": "Quick question: I'm confused about where my recent test results went. I need them for my next appointment on Friday. Did they get lost in the system somehow?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 60}
{"text": "The portal record for my visit shows the refill request hasn't been processed yet, even though I submitted it two weeks ago. I'm really anxious and frustrated about the delay, and it's causing me disappointment because I need this medication urgently.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 61}
{"text": "Following up: We're waiting for the test results for Mom, and it's been over a week now. This is getting frustrating, and I'm not sure what to do.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 62}
{"text": "I'm following up for my brother who is recovering from surgery. His recent blood test results are still pending, and we're getting increasingly anxious. The lab has assured us they're working on it, but the delay is causing confusion and frustration. We need to understand when we can expect these critical findings.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 63}
{"text": "The medication side effects are causing severe anxiety and dizziness.   The doctor’s instructions were unclear, leaving me frustrated.   I need to schedule a follow-up appointment as soon as possible.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 64}
{"text": "Following up on the request from last week, I wanted to follow up regarding my prescription renewal. It seems there's a delay, and I'm disappointed about having to wait longer. I just received a call from someone who mentioned Case #78935 and said they're working on it. I hope this doesn't cause too much of a problem for my medication schedule.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 65}
{"text": "I'm reaching out for my spouse. I'm really disappointed that their symptoms have worsened despite the medication, and I'm feeling frustrated with the lack of improvement. I'm worried they might need a refill sooner than expected, but I'm not sure how to get that sorted.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 66}
{"text": "Need clarification: My son's medication is not available. I'm confused about the timeline and what steps I should take next. When can we expect it to be resolved?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 67}
{"text": "I'm messaging for a family member in my care.  My mother has been experiencing some new, unexplained symptoms lately, and I'm really worried. She's had a bit of confusion and frustration with how things have been progressing. I'm trying to keep track of everything, but it feels overwhelming. She's having trouble sleeping and seems anxious about what's going on. I just wanted to let you know and see if there's anything you can suggest or if we need to schedule another appointment soon.  I'm feeling quite disappointed with the lack of clear answers so far, and it's causing a lot of anger for both of us. I'm hoping for some resolution here soon.  Thanks for your help.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 68}
{"text": "I checked the portal this morning and noticed that the imaging report for the unclear findings hasn't been posted yet. I'm anxious about the delay and frustrated because I've been waiting for this information to schedule the next step in care. It seems like there might be a missing update or something is stuck in the system. I'm hoping to get clarification soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 69}
{"text": "What happened: My son's recent blood test results haven't been received yet, and his appointment was over a week ago. I've called the lab twice and they keep saying they're looking into it. This is causing significant anxiety for our family. We need to know when we can expect the results.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 70}
{"text": "The nurse said, \"I'm sorry, but the prescription was sent to the wrong pharmacy by mistake. It should have been sent to your usual one.\"", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 71}
{"text": "Last Thursday, I called the pharmacy to refill my son's asthma medication, and they said the wait would be about a week. This started about a week ago when I first called, they told me they were out of stock and I needed to wait for a new shipment. Today, I called again, and they admitted it's still not here, and they don't know when it will arrive. I'm anxious about his condition worsening, confused why the wait is so long, frustrated with the lack of communication, and angry at how poorly they're handling it. Disappointment is setting in because I thought they'd have better systems in place.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 72}
{"text": "I'm following up for my elderly relative. I'm disappointed to report that despite multiple attempts to resolve this issue, I haven't received a clear answer yet. The administrative delay is frustrating, and it's causing confusion about when things will move forward. I need to understand the timeline for this matter, and it's concerning that we're still waiting without resolution. I'm feeling anxious about the lack of progress, and I hope for a more timely response soon.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 73}
{"text": "On the patient portal, the status shows that repeat testing is required for your upcoming appointment. I understand this might cause some anxiety, but I wanted to let you know that we're tracking this closely. You can find the details and instructions in your portal record. Let me know if you have any questions or need clarification.  The reason for the repeat testing is to ensure accurate results for your current treatment plan. It's important for us to have up-to-date information to provide the best care.  I've also included your case number, 234567, for reference. If you're running late or have any concerns about the testing process, please reply to this message or call the office directly. We're here to help.  Please update your portal with any recent symptoms or changes in how you're feeling. This will assist us in preparing for your visit.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 74}
{"text": "I'm following up for my elderly mother regarding a billing discrepancy I noticed on her account statement. I was confused when I saw the unexpected charge for a service she hasn't used recently, and frankly, I'm frustrated that it wasn't cleared up during our last call with the billing department. I'm reaching out now to clarify what this charge is for and if there's any mistake in the billing process. I'm attaching a screenshot of the statement for your reference. I'm anxious to resolve this before the end of the month so we can budget accurately for her ongoing care. Please let me know the best way to proceed or if you need additional information from my end to review this issue.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 75}
{"text": "Following up on the request from last week, I wanted to mention that the doctor has ordered a repeat test. I'm a bit confused about why it's needed again, especially since I just had it done a month ago. It feels like a waste of time, and I'm disappointed with the situation. Could you clarify the timeline or case number? I'm trying to keep track, but it's getting a little overwhelming.  I understand that it's part of the ongoing care, but I'm still confused about the timeline. The last test was on October 15th, and now we're ordering another one. I'm trying to stay positive, but the repetition is causing some anxiety. I need to know if there's a specific reason or if it's just a standard procedure. I'm disappointed that I have to go through this again, but I'll do whatever's needed for my care.  I've been following the instructions carefully, but I'm confused about the difference between this test and the previous one. The dates don't seem to align, which is causing some frustration. I'm disappointed that I might need to wait longer for results, but I trust the medical team. Could you provide any additional context or a case reference to help me understand better?  I'm trying to manage my expectations, but the confusion is making it harder to cope. The doctor mentioned it was necessary, but I'm still disappointed that it's repeating. I need to know if there's a specific date or case number I can refer back to. I'm anxious about the delays, but I'll proceed with the required steps.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 76}
{"text": "Following up: I'm calling about my son's recent imaging results. The report mentioned something unclear, and I'm anxious to understand what it means. I've been trying to get a clearer explanation, but it's frustrating with the delays.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 77}
{"text": "Quick question: I'm checking on my delayed lab results from last month. When can I expect to get them? I'm a bit frustrated waiting so long.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 78}
{"text": "Re: the issue from my last call, I'm still concerned about my insurance coverage for the upcoming appointment scheduled for August 15th. I called last week to clarify the co-pay, but I've received conflicting information from two different representatives. One said it was covered under my HMO plan, but the other mentioned a prior authorization needed which hasn't been processed yet.  I'm worried this might cause a billing issue down the line, especially since I'm on a tight budget. My case number is 789456, and I need some clarity as soon as possible. The back-and-forth has left me feeling frustrated and anxious, not to mention disappointed in how this is being handled.  I've been trying to get this sorted out for weeks now, and it feels like we're just spinning our wheels. When can I expect confirmation that the authorization is complete? I need to make sure I'm prepared for this visit without unexpected charges.  Thank you for your help, but I'm really hoping for a resolution this time.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 79}
{"text": "I'm having trouble accessing the patient portal and I'm really frustrated. I've tried logging in multiple times today but keep getting an error message. This is making it difficult to manage my care, especially with my elderly status. I need this issue resolved as soon as possible. I'm considering calling the support line myself.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 80}
{"text": "During the call, I was told that my referral for the specialist appointment is still pending approval, and they don't expect a decision until next month. I'm confused because I thought they said it would be processed quickly. I've been dealing with this issue for weeks now, and it's causing significant delays in my treatment plan. I'm really frustrated and angry about the lack of clarity and the extended waiting time.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 81}
{"text": "They said the imaging results were unclear and they're sending it back for another look, but I'm still worried about what that could mean.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 82}
{"text": "Last Thursday, I called the insurance company to get approval for my father's new medication, and they said it would take five business days. I was confused because the prescription was filled yesterday, and we're still waiting. Today, I received a call saying the approval was denied due to prior authorization not being submitted, which I hadn't heard about before. I'm disappointed and anxious about getting the medication he needs on time, and I don't understand why this wasn't communicated earlier.  I called again this morning to ask about the next steps, but the representative couldn't give a clear timeline, just that it might take another week. I'm frustrated by the lack of clarity and worried about his condition worsening while we wait.  I need to figure out how to get this sorted quickly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 83}
{"text": "Hi, I'm writing to let you know about the missed medication instructions. I checked the portal this morning and noticed that the instructions for the new medication weren't updated there. They're supposed to be available by now, but they're still missing. I'm confused about what's going on because the last message said they would be posted by yesterday. This is frustrating because I need to know the correct dosage and timing to help my brother manage his condition properly. I'm worried we might be giving him the wrong dose if we don't get this sorted soon. I'm calling to ask for an update because the portal isn't helping me resolve this issue.  Also, the patient portal shows that the refill request for his hypertension medication was processed, but I haven't received the confirmation email yet. That adds to my confusion and frustration about the system not working correctly.  I'm disappointed that despite being a young adult, he's dealing with this complexity, and I'm anxious about any potential errors. I need to understand why the instructions are still missing and what the timeline is for their availability. I'm calling now because waiting feels unsafe and I need reassurance.  Could you please check when the portal will be updated and if there are any other missing details? I appreciate any guidance you can provide to help us manage this situation effectively.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 84}
{"text": "I'm calling today because I'm still waiting for my appointment to be scheduled. I've checked the portal, but there's no update there either. It's been over a week now, and I'm getting really frustrated and disappointed that they're not responding. I need to speak with someone sooner.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 85}
{"text": "Last Thursday, I met with Sarah from billing to discuss my recent surgery and the associated costs. I was given a detailed breakdown, but it wasn't clear who was responsible for paying the co-pays and deductibles. By Tuesday, I received a letter in the mail stating that my insurance didn't cover the full amount, leaving a balance due immediately.  I'm anxious about the unexpected bill, and I'm confused about why the coverage wasn't clarified during my visit. I called the office yesterday to ask for clarification, but they couldn't provide an answer by the end of the day. Today, I plan to schedule an appointment with the billing manager to get a clearer timeline and understanding of my payment responsibilities.  I'm disappointed that it's taken this long to resolve, and I'm frustrated that the initial explanation was so vague. Hopefully, this will be resolved soon.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 86}
{"text": "Last Thursday, I logged into my son's health portal account to review the recent lab results after his appointment for hypertension. I noticed that the portal was missing his latest echocardiogram report from the cardiologist, which was sent two weeks ago. I tried uploading the document myself using the portal's upload feature, but I kept getting error messages saying the file was too large or the format was incompatible. I called the office on Tuesday to ask about the missing report and was told they were still waiting for the doctor to send it electronically. Now, I'm worried because my son's condition needs monitoring, and without the report, his primary care physician can't make informed decisions. I'm frustrated that this issue isn't being resolved quickly, especially since I've already tried multiple ways to provide the necessary documents.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 87}
{"text": "Re: the issue from my last call, I'm calling again because I'm still having trouble with the new treatment plan. I was given the details on August 15th, and it's causing me a lot of confusion. I feel disappointed that we're still not on track, and I'm getting frustrated with the delays. I need to understand what's being done to resolve this by my appointment next week.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 88}
{"text": "What happened:  The recent imaging results show some unclear findings that need further review.  We're scheduling a follow-up appointment to discuss these details.  In the meantime, I'm feeling anxious about what this might mean.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 89}
{"text": "The nurse said, 'The discharge instructions were a bit unclear, but we can give you a copy of the meds to take home.'", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 90}
{"text": "I'm contacting you for my mother regarding her recent hospital visit and the ongoing confusion about her unclear diagnosis. I've been trying to understand what's going on with her symptoms, but the doctors keep giving vague answers, which is frustrating. They've scheduled another test, but it's been delayed due to scheduling issues, and I'm worried about how long this will take. My mother is confused about why she's still feeling unwell and is anxious about the possibility of something serious. I'm reaching out to ask if there's any update or if we can get a clearer timeline from the portal. I'm disappointed that the resolution is taking so long, but I need to be patient for now.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 91}
{"text": "Last Thursday, I was feeling pretty good after the doctor's visit, but then I started experiencing some symptoms again, which really threw me off. I remember the nurse gave me instructions about a new medication regimen, but I wasn't paying close enough attention and now I'm worried I might have missed something important. Over the past two weeks, I've been trying to piece together what I was supposed to do, but it feels like every time I think I've got it figured out, something else comes up. For instance, on Monday, I realized I might have forgotten to take the morning dose, and then on Wednesday, I saw a refill request was denied because I hadn't completed the previous course properly. This whole thing is making me feel really frustrated and angry because I don't want to be dealing with this uncertainty and potential setbacks. I'm so disappointed that the instructions weren't clearer, and honestly, I'm starting to feel anxious about what might happen if I mess this up completely.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 92}
{"text": "During the call, I was told that my insurance coverage for the refill has been denied due to a pre-existing condition clause. I'm really frustrated because I've been managing this for years and it feels unfair. What steps can I take to resolve this?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 93}
{"text": "Need clarification: I'm confused about how to manage my persistent pain. The last refill was supposed to be last week, but I still haven't received it. This is frustrating and making my condition worse. What's the timeline for the next refill? Case #12345.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 94}
{"text": "On the patient portal, the status shows that my recent payment responsibility for the refill was not cleared, and I'm confused about who should cover it now.  I checked the portal record for my visit, and it says the case number 789564754 was flagged for payment clarification.  I'm anxious about the billing timeline and when this issue will be resolved.  I'm frustrated that the portal isn't providing clearer information on this matter.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 95}
{"text": "Regarding my previous message, I'm still confused about who is responsible for the payment for my son's medication. Last week, on August 15th, the pharmacy called and said there was an issue with the insurance claim. I've been trying to get this sorted out, but I'm running into roadblocks. I'm really disappointed that this hasn't been resolved yet, and I feel frustrated that I have to keep following up. Can you please clarify the situation and let me know what steps we need to take next?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 96}
{"text": "I'm writing on behalf of my father regarding the insurance coverage issue. They've been trying to get this sorted for weeks, but we're still waiting on the resolution. I'm really disappointed that it's taking so long, especially since he's been having ongoing treatment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 97}
{"text": "Quick question: I'm getting conflicting advice from two doctors about my treatment. One says it's urgent, the other says wait. I'm really confused and anxious about what to do.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 98}
{"text": "I checked the portal this morning and saw that my prescription renewal is still pending. It's been over a week now, and I'm due for a refill. I'm getting concerned about managing my condition with the current supply. When can this be updated?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 99}
{"text": "I checked the portal this morning and I'm still not seeing the instructions for my missed medications. This is frustrating and I'm really worried about managing my treatment without clear guidance. I need this information urgently.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 100}
{"text": "Details:  We tried to schedule an appointment for my son's follow-up, but all available slots are filled until next month.  I've been calling multiple times, and the pharmacy hasn't confirmed the refill request yet.  I'm worried about his condition and need to get this resolved soon.  What happened:  The administrative team confirmed there are no immediate slots available.  They suggested checking back in two weeks, but I'm anxious about the delay.  I need to understand the timeline for the next appointment.  Here are the main points:  - All appointments booked until next month. - Pharmacy refill still pending confirmation. - Worry about my son's health worsening. - Request for clearer timeline from admin.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 101}
{"text": "The pharmacist mentioned there was an unexpected charge on the bill.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 102}
{"text": "Since my appointment earlier this month, I've been dealing with this scheduling mess. I called to schedule a follow-up, and they kept putting me on hold for 20 minutes on Monday. Then, when I finally got through, they said the only available slot is next Friday, which conflicts with my work schedule. I'm confused about why it wasn't available sooner. This started about a week ago when I first tried to book, and now I'm anxious because my condition isn't improving. I thought they'd have a better system, but I'm frustrated and disappointed with the service. I need to get this sorted quickly.  Timeline: - Monday: Called and was on hold for 20 minutes. - Today: Received the next available slot conflicting with work.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 103}
{"text": "In my portal messages, I can see conflicting advice from two different doctors. One says to start a new medication, and the other recommends against it. I'm confused about what to do, and it's frustrating that I don't have a clear answer yet. The case number is 789456.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 104}
{"text": "One issue: I'm really anxious and frustrated about the delayed lab results for my mom. When can we expect them? This is causing a lot of confusion in our treatment timeline.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 105}
{"text": "I'm reaching out for my sister. I'm calling because her prescription for her arthritis medication just came up, but it seems they're not available at the pharmacy anymore. I'm confused about why that is and a bit anxious because she's having a lot of pain right now. She's supposed to refill it next week, but I'm not sure how we'll manage in the meantime. I've been trying to figure out what to do, but I keep running into roadblocks. I'm really worried about her comfort and if there's any way we can get the same medication elsewhere.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 106}
{"text": "Quick question: I'm not seeing much improvement in my symptoms with the new treatment. I'm a bit disappointed and frustrated, wondering if we need to adjust something.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 107}
{"text": "I checked the portal this morning and noticed that the referral for my mother's specialist was sent incorrectly. It was labeled as a refill instead of a referral, which caused confusion. I'm anxious because we're relying on this portal for updates, and I'm worried about the delay in getting it corrected. The status shows it's still pending, but I'm not sure when it will be resolved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 108}
{"text": "What happened: My son's chronic asthma management has been challenging lately. The refill request for his inhaler was denied twice due to insurance issues. He's experiencing more frequent symptoms, and I'm worried about his upcoming specialist appointment next week. I need a clearer timeline for when the insurance will approve the refill. I feel frustrated and disappointed by the lack of resolution.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 109}
{"text": "I'm confused about why repeat testing is required at this stage. Could you explain the reasoning?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 110}
{"text": "I just got off the phone with the scheduler and they said they're still waiting for insurance approval to move my appointment to a different date. This is the third time I've been told this, and frankly, it's frustrating.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 111}
{"text": "This started about a week ago when I received my discharge instructions from the hospital after my surgery. The doctor provided a brief overview, but there was no clear guidance on post-operative care, follow-up appointments, or how to manage potential complications. I tried calling the clinic twice during that week, but both times I was put on hold for over 30 minutes and then transferred to voicemail because the nurse was unavailable. On Tuesday, I finally reached a nurse, but she only gave me generic information without specifics. I'm feeling frustrated because I don't know when to worry or what signs to look out for. For example, I'm not sure if the pain I'm experiencing is normal or if it indicates something serious. I've been researching online, but it's confusing without my specific medical details. I'm worried about making the wrong decision and putting my health at risk. I called again yesterday, and this time the nurse finally gave me some clear instructions, including a follow-up appointment scheduled for next Monday and specific warning signs to watch for. It's a relief to finally have some direction, but I wish the initial guidance had been better.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 112}
{"text": "Following up on the request from last week, I wanted to let you know that the treatment for my mother's symptoms hasn't been improving as expected. I'm a bit confused about the timeline for adjustments and feeling frustrated with the current progress. Also, case number 5678 was mentioned in our last discussion.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 113}
{"text": "What happened: Your recent test results require a repeat test due to unclear findings.  I understand this may cause concern.  Please schedule the repeat test as soon as possible.  I will explain the need for this in our next visit.  Anger and disappointment are valid here.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 114}
{"text": "Regarding my previous message, I'm still confused about the side effects listed for the medication. I called on October 5th, and the information provided was unclear. I'm disappointed that I haven't received a clearer explanation yet.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 115}
{"text": "Re: the issue from my last call, I'm still confused about the long wait times for my appointment scheduled for October 25th. Case number 789456, my doctor's office is expecting me to wait three weeks for a referral that was already on file. This is frustrating and I'm anxious about the delay in getting treatment.  I called last Tuesday and was told the wait would be resolved by next week, but I'm seeing no updates. Can you please clarify the timeline and provide a case reference? I'm disappointed with the lack of progress.  Best regards,  [Parent's Name] ", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 116}
{"text": "Hi, this is Sarah calling about the missed dose of medication yesterday. I was supposed to give the pill at 8 PM, but it was not administered. Could you please clarify what time the medication should have been given? I'm anxious about keeping track of all these instructions and worried I might be doing something wrong. I'm confused about the schedule and frustrated that I missed this important detail.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 117}
{"text": "The receptionist told me that they're having trouble scheduling the specialist appointment, and my mom's condition is acting up again.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 118}
{"text": "During the call, I was told my insurance didn't cover the refill, but I called last month and they said it was okay.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 119}
{"text": "Following up: I'm calling because I didn't get a response to my previous inquiry about the referral for my daughter. I'm feeling quite frustrated that it's been left unresolved for so long. Can you please update me on the status? What's the expected timeline for this? Thanks.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 120}
{"text": "Insurance claim was denied by the payer.  We were denied due to missing documentation.  I'm anxious about the delay in getting this resolved.  I need guidance on how to appeal this decision.  Please let me know the next steps.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 121}
{"text": "I checked the portal this morning and noticed a discrepancy in the billing statement. It seems like a charge was applied incorrectly, and I'm confused about why it's showing up now. I'm frustrated because this has happened before, and it's causing me a lot of trouble. I'm disappointed with how this is handled, and I don't feel satisfied with the current resolution since it's delayed. Can we resolve this sooner?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 122}
{"text": "Following up: I'm having trouble reaching my doctor about my refill. I've tried calling multiple times but keep getting voicemail. This is causing anxiety as my symptoms are worsening. What can be done?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 123}
{"text": "This started about a week ago when I received the monthly bill from the clinic, and it included charges for a refill that I didn't authorize. I called the billing department and was told that since my insurance coverage was recently changed, the responsibility now falls to me. I'm confused because I didn't make any changes to my coverage, and my daughter, who usually handles this, is out of town. Over the past two days, I've tried to get clarification through the portal, but the messages are vague, and I've been disappointed by how unclear the process is. I'm anxious about the payment and frustrated that it's taking so long to resolve, especially since my father has been dealing with chronic pain and needs this medication consistently. I'm worried about the timeline because the refill is due again in three days, and there's no clear resolution yet.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 124}
{"text": "During the call, I was told, \"The insurance claim was denied due to a billing discrepancy, and we're looking into it.\" I'm confused about what went wrong.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 125}
{"text": "The portal record for my visit shows that my recent imaging results are unclear and need further review by the radiologist. I'm confused because I was expecting a clearer update by now, and this lack of clarity is frustrating. I've tried checking my portal account multiple times, but there's no mention of what's being done to resolve this. I'm disappointed with the timeline and would appreciate a call to explain the next steps.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 126}
{"text": "I'm calling about the missing documents in my patient portal.  I've been trying to access them for a few days now, but they're nowhere to be found.  This is frustrating because I need them to complete my insurance claim.  I appreciate any help you can provide to resolve this.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 127}
{"text": "The pharmacist mentioned that the dosage instructions were unclear, and I'm still confused about how much to give my child.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 128}
{"text": "I'm calling today to follow up on my father's recent appointment. They haven't responded to our message about scheduling a follow-up visit, and I'm getting increasingly frustrated. The delay is causing anxiety, especially since his condition requires timely attention. I've been trying to get a refill for his medication, but that also went unanswered. This lack of communication is really angering me, and I'm disappointed with the service they're providing. I need to resolve this quickly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 129}
{"text": "Following up on the request from last week, the rescheduling of our appointment to June 15th was due to availability. However, I'm still waiting for confirmation on that date. I understand the delays, but it's been difficult to coordinate this multiple times. I'm disappointed with the ongoing changes and confused about when this can finally be resolved. I need to know if there's a specific timeline or if another date will be necessary.  Looking at Case #45879, I've been trying to secure a consistent schedule for my care, and this continues to be challenging. I'm hoping for a resolution soon, as my treatment timeline requires stability.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 130}
{"text": "I'm messaging for a family member in my care. I'm really disappointed to hear that the insurance claim was denied. I'm anxious about how this will affect her treatment timeline and medication refills. I need to understand the reason for the denial and what steps I can take to resolve this. This situation is causing me a lot of confusion and frustration, especially since she's elderly and relies on these services regularly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 131}
{"text": "I'm still waiting for the documents that were supposed to be uploaded to my portal account.   It's been over a week now, and I haven't received any updates.   I'm anxious about the delays, and this is causing me confusion about what's going on.   I'm really frustrated with the lack of communication.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 132}
{"text": "What happened: My recent blood test results haven't been posted on the portal yet. It's been two weeks since the lab contacted my provider. To clarify, I asked for an update yesterday during my call and was told it would be ready by Friday. Summary: I'm worried because this delay might affect my treatment plan, and I haven't received any follow-up email either. ", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 133}
{"text": "Following up on the request from last week, I'm still confused about my new medication dosage. The instructions were unclear, and I'm worried I might be taking too much or too little. This has caused me frustration and disappointment, especially since I've been dealing with side effects. I called the clinic twice already, but the information hasn't been consistent. I need a clear explanation before my next appointment on August 15th. Case #23456.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 134}
{"text": "The nurse said, \"I know it's been tough, but we're still seeing no improvement with the treatment, and we need to schedule a follow-up to discuss other options.\"", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 135}
{"text": "Following up: I'm reaching out because I submitted a referral to Dr. Smith last month, but I haven't received any updates. They reportedly don't accept referrals from my primary care provider. I'm confused about the next steps and concerned about delays in my treatment. This situation is frustrating and causing anxiety about my health timeline.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 136}
{"text": "This started about a week ago when I tried to schedule a refill for my prescription. Last Thursday, I called the office because the portal message said the refill was processed, but my insurance hasn't updated to reflect it. I'm disappointed that despite multiple follow-ups, there's still no resolution. I'm confused about the timeline and frustrated that it's taking so long.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 137}
{"text": "Need clarification: Regarding my insurance coverage issue, I'm confused why the claim was denied despite being covered for this procedure. I'm frustrated and angry that this is causing delays in my treatment. I need to understand what went wrong quickly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 138}
{"text": "This started about a week ago when I received my prescription refill for my asthma medication. Everything seemed fine until I called the pharmacy yesterday because my symptoms were not improving. I explained that I had a follow-up appointment last Tuesday, and they mentioned sending a referral to the pulmonologist. But when I checked online today, the referral status shows it was sent incorrectly—some of the details are wrong, and it hasn't been resent. I'm feeling really frustrated because this delay could impact my care, and I'm worried about managing my condition with the wrong information. I called the pharmacy again this morning, but they said they're still waiting for the correct referral from my doctor's office. I'm angry that this administrative error has caused such a mess, and I'm disappointed in how things are handled. I need this to be resolved quickly so I can get the proper care.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 139}
{"text": "Need clarification: I'm confused about why the refill request is still pending in the portal even though I submitted the documents. I'm frustrated because this is causing delays, and I'm anxious about the patient's medication schedule.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 140}
{"text": "After the visit, I received a call saying my insurance claim was denied. I was told it was because of a pre-existing condition, but I never mentioned that before. I'm confused and frustrated because I thought they reviewed my entire history. My appointment was scheduled for last Tuesday, and I'm still waiting for the appeal process to start. This is frustrating and disappointing, especially since I've been dealing with this issue for weeks now.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 141}
{"text": "I checked the portal this morning and noticed that my recent lab results are still pending, which is causing some concern. I'm trying to understand why they haven't been uploaded yet. The portal now shows that there's a missing document from my last visit that needs to be submitted before we can proceed with my medication refill. I'm confused about which document this is and when it should be expected. It's frustrating that this issue is still unresolved after several weeks. I'm angry that the pharmacy is unable to clarify this quickly. I've been disappointed with the lack of timely updates on my records. I just want to get my medications refilled without these unnecessary delays.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 142}
{"text": "After the visit, I received my test results through the portal, but they weren't clear, and I'm confused about what it means. I called the office on Tuesday to ask for clarification, but the nurse wasn't sure either. I'm anxious because I need to understand this to move forward with my treatment plan.  Timeline: - Visit on October 15th - Called office on October 22nd  I'm still waiting for a clearer explanation from my doctor.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 143}
{"text": "Following up: I tried to schedule an appointment but keep getting told there are no available slots. This is frustrating and disappointing, especially since I need this urgently. When will there be availability?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 144}
{"text": "They told me the follow-up appointment is delayed until next week, but I was under the impression it was supposed to be sooner. It's frustrating that they couldn't schedule sooner.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 145}
{"text": "Quick question: I'm having trouble reaching my doctor about my recent test results. I've tried calling multiple times but keep getting voicemails. This is frustrating and disappointing, especially since I'm elderly and need timely answers. Is there any way to expedite this or get a callback?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 146}
{"text": "I'm reaching out for my spouse regarding his recent blood test results. I know it's been a bit of a wait, but I'm trying to help him understand what's going on. He's been asking about the timeline, and I'm honestly a little frustrated by the delay. I've tried calling the lab several times, but they keep saying it's still pending. It's frustrating to not have a clear answer. I'm also a bit disappointed that it's taking so long, especially since he's been feeling under the weather. I'm trying to stay patient, but I'm not satisfied with how things are progressing. I appreciate any updates you can provide, as I want to make sure we're on the right track.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 1}, "id": 147}
{"text": "Following up on the request from last week, I'm still confused about the missed instructions for my medication. I was disappointed when I didn't see the refill completed by the date provided, and I'm anxious about how to proceed without clear guidance. Case number 123-456.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 148}
{"text": "This started about a week ago when I called to schedule a refill for my chronic medication. I was put on hold for over 20 minutes and then transferred three times before finally getting through to a nurse. Since then, I've tried calling back multiple times, but each time I'm told the wait times are long due to staffing issues. I'm really concerned about managing my condition with such delays. Today is only day five, and I'm starting to worry this might become a regular occurrence.  I understand the system is busy, but the lack of clear information on when things might improve adds to my frustration. I've tried checking the portal, but it doesn't show any updates on wait times or estimated wait for refills. It's been a constant battle just to get basic care, and I'm worried this will affect my daily routine even more.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 149}
{"text": "During the call, I was told that my test results might indicate a rare condition, but they're not sure yet. They said they'd schedule a follow-up with the specialist.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 150}
{"text": "I'm calling about my appointment with Dr. Smith on 09/15/2023.  The wait time was about 45 minutes, which is longer than usual.  I understand the delays are due to staffing issues.  They promised a follow-up call by Friday.  I'm anxious about the wait but satisfied with the resolution.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 151}
{"text": "I checked the portal this morning and was disappointed to see that the refill request for my son's asthma medication hasn't been processed yet. It's due for refilling next week, but we're running low and it's causing me anxiety about managing his condition. The portal record shows the request was submitted on Monday, and there's no update since then. I'm confused why it's taking longer than expected, and this frustration is growing. I need to schedule a call with the pharmacy to get this resolved quickly.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 152}
{"text": "Hi, I'm calling again because I'm still waiting on the insurance approval for the medication. Last week, we discussed this, and I was told it would be sent by Friday, but I haven't heard anything yet. I'm a bit frustrated because my son is due to refill his prescription soon, and this delay is causing some anxiety. Could you please check the status? Thanks,", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 153}
{"text": "I'm calling about my daughter's medication dosage. The doctor changed it, but I'm confused about how much to give her. The pharmacist mentioned that the new dose is twice a day, but I'm still not clear on the timing or if it's correct. I feel anxious because she's been having side effects, and I don't want to make a mistake.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 154}
{"text": "During the call, I was told the dosage should be increased, but my daughter's primary care physician recommended keeping it the same. I'm really confused and frustrated about all the conflicting advice I'm getting.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 155}
{"text": "On the patient portal, the status shows that my appointment has been rescheduled three times now. I'm really disappointed with how this has unfolded. Each time, the new date is just as problematic as the last one. I'm anxious about when it will finally be resolved. I'm confused about the reasons behind these repeated changes. This situation is frustrating, and I'm concerned about how it will impact my ongoing care timeline.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 156}
{"text": "The nurse said, \"The imaging results are unclear, and they're sending the report to a specialist for further review. I'm not sure what that means or how long it will take.\"  I've been dealing with this for weeks now, and it's really frustrating not having any clear answers.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 157}
{"text": "I'm writing on behalf of my father who is waiting for a long time for his appointment. I'm confused about the timeline and when we can expect a call back. This is frustrating and disappointing, but I'm anxious about his condition worsening.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 158}
{"text": "At the front desk they told me my appointment was confirmed, but the email I received said it was canceled. That can't be right.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 159}
{"text": "Details:  I'm having trouble accessing the patient portal and need help.  I've tried logging in multiple times but keep getting errors.  This is causing me anxiety as I need to check my test results.  I'm disappointed with the current access issues.  Please let me know when the portal will be fixed.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 160}
{"text": "Quick question: I'm confused about the recent portal update regarding my refill request. I'm anxious because I need this medication and the timeline is unclear. My case number is 789456.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 161}
{"text": "Following up on the request from last week, I wanted to let you know that the treatment hasn't been helping with my symptoms. I'm scheduled for a follow-up on August 15th to discuss other options. Let me know if there's anything else needed from my end by then. I'm anxious about finding a solution soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 162}
{"text": "I'm following up for my mother. The doctor called and said she needs repeat testing because her recent results weren't clear. I'm worried about the delays and the extra stress on her. It feels like we're going back and forth without much progress. I need to understand why the tests aren't conclusive and what steps we can take next.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 163}
{"text": "Following up: I called yesterday about scheduling my daughter's appointment, but couldn't get a clear answer. I'm disappointed and frustrated because she's elderly and needs this soon. Can you help resolve this?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 164}
{"text": "During the call, I was told the doctor is out of office until next Tuesday due to illness.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 165}
{"text": "Checking on something: I'm still waiting for the test results and it's been a week now. I'm getting frustrated because this is affecting my mental health. What can be done to get an update?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 166}
{"text": "I'm contacting you for my mother regarding the refill request we submitted last week. I'm getting conflicting information from the pharmacy staff. One person said the refill was approved and should be ready by Friday, but another told me there's a problem with the prescription and it needs to be resubmitted. I'm confused about what's going on and when she can get her medication. This is causing some anxiety, and I'm disappointed that we're not getting clear answers. I'm hoping to resolve this soon to avoid any disruption to her treatment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 1}, "id": 167}
{"text": "Details: I was doing well after my last visit, but now I have a sudden flare-up with severe pain. I'm confused why it's acting up again, especially since I'm sticking to my treatment plan. This frustration is frustrating me because it feels like we're back to square one.  To clarify, I want to schedule an urgent appointment to figure this out.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 168}
{"text": "One issue: The medication for my elderly parent's refill is not available. I'm anxious and frustrated about the delay.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 169}
{"text": "I'm calling about the appointment cancellation without prior notice.  I was looking forward to this visit and had made time for it.  This situation has caused me frustration and disappointment.  I would like to reschedule for the next available date.  Thank you for your assistance.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 170}
{"text": "Summary: I'm calling because I received conflicting information about my appointment date from two different staff members.  What happened: One said it was scheduled for next Tuesday, but another confirmed it's actually this Friday.  Confusion: This is causing me a lot of uncertainty about when I should prepare for my visit.  Frustration: I've already made other plans based on the initial information provided.  Need: I want a clear confirmation from the office about the correct date to avoid further mix-ups.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 171}
{"text": "I'm writing on behalf of my father, who is 85 years old and has been dealing with some confusion about his medication schedule recently. He's been on a new dosage for his hypertension, and I've noticed he's mixing up when to take his pills and what doses go with which medications. I'm his primary caregiver, and I'm worried because he mentioned feeling dizzy at times, which I think might be related to the dosage confusion. We've been trying to clarify things with the instructions, but it's all in medical terms that he finds hard to follow. I called the pharmacist yesterday, and they explained it again, but he still seems unsure. I'm anxious that this could lead to complications if not resolved. I'm hoping the team can provide clearer instructions or maybe a simpler pill organizer to help manage his meds safely.  I'm a bit frustrated because I've spent so much time trying to help him understand, but it feels like we're not getting there. My father has always been independent, and this is making him hesitant to leave the house, which is another source of worry. I appreciate any support or guidance you can offer to make this easier for both of us.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 172}
{"text": "Hi, I'm calling again about my insurance coverage for the treatment I was scheduled to start last month. I know this is taking longer than expected, but I'm still anxious and frustrated because I've been trying to get a resolution for weeks. Can you update me on what's happening with my case, CASE-7894? I need to know by Friday or else I might have to delay my treatment due to the billing issue.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 173}
{"text": "This started about a week ago when I received my mammogram results and saw the note about unclear imaging findings. I immediately called the office to schedule a follow-up appointment, which was set for three days later. Since then, I’ve been waiting for the specialist to review the images, and it’s been a week since my appointment, but I still haven’t heard back. I’m frustrated because I need answers, and this uncertainty is causing me a lot of stress. I just want to know what’s going on with my results.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 174}
{"text": "The portal now says there was an adjustment to my recent co-payment, but I don't see the details. Why was this change made, and how does it affect my account? I'm confused and frustrated about the billing discrepancy.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 175}
{"text": "I'm messaging for my father who is in assisted living. I recently received a letter saying his insurance claim was denied, and I'm confused about the reason since he's been receiving care consistently. I called the insurer but the resolution is delayed, which is disappointing. I'm worried about affording his care now without the coverage.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 176}
{"text": "Since my appointment earlier this month, I've been trying to get my test results, but it's been a nightmare. I called the lab on Monday, August 15th, and they said they'd send them to my portal, but as of today, September 5th, nothing has shown up. I'm checking every day, and I'm starting to get really frustrated. I even called again yesterday, and the woman on the phone was so dismissive, saying it must be in the system somewhere. But I'm confused because my doctor's office assured me they would have them by now. I'm anxious about my upcoming surgery next week—without these results, they can't finalize the procedure. I've been stuck in this loop for over two weeks, and it's causing me a lot of anger and disappointment. I need to get this sorted out soon.  I've been calling the lab multiple times and checking my portal every day since August 15th.  They keep saying the results are on the way, but nothing has appeared in my portal by September 5th.  My doctor's office called on August 22nd and said they would expedite it, but still nothing.  I'm worried this delay might affect my surgery scheduled for September 10th.  I feel like I'm being brushed off, which is frustrating and adds to my confusion about why this is taking so long.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 177}
{"text": "Following up on the request from last week regarding the conflicting medical opinions about my daughter's treatment plan,  I'm still confused about how to proceed now that two specialists have given different advice.  Could someone from the pharmacy clarify if there's an error in her chart or help me understand the discrepancy?  I'm worried this confusion might delay her treatment, and I'm anxious about making the wrong decision for her.  I have her case number, 789-2024, and the last discussion was on October 15th. Any guidance would be greatly appreciated.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 178}
{"text": "Details:  There seems to be conflicting information regarding the patient's appointment date. One staff member mentioned it was scheduled for June 15th, while another referred to July 1st. This discrepancy is causing confusion and anxiety about the correct timeline for the visit.   I have reached out to both parties to clarify, but the situation remains unresolved.   Looking for confirmation to ensure proper scheduling.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 179}
{"text": "After the visit, I'm still feeling frustrated because my symptoms haven't improved despite following the treatment plan. This started about a week ago when I noticed increased pain and fatigue, which was concerning given how well I was doing before. I've been taking the medication as prescribed, but I haven't seen any change in my condition. It feels like we're stuck in a loop, and I'm worried this timeline might extend longer than expected. I'm hoping we can explore other options soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 180}
{"text": "I'm calling about my prescription refill.  I've been waiting for over two weeks now, and it's causing me to run out of my medication.  This is the second time this month that I've had a long wait for a refill.  I'm confused why the process takes so long, especially since I'm an adult patient with a stable condition.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 181}
{"text": "Following up on the request from last week, I wanted to mention that my knee pain is returning after the treatment I received. It feels similar to what it was before, and I'm concerned about this. I scheduled an appointment for next week, but I'm disappointed that it's not fully resolved yet.  Date of last visit: October 15 Case number: 789456", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 182}
{"text": "I'm really disappointed with how I'm feeling. I started this treatment hoping for improvement, but my symptoms haven't changed at all. The last visit, the nurse said we'd continue monitoring, but I'm not sure what that really means or when things should get better.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 183}
{"text": "Details: I'm still waiting on my prescription refill for blood pressure medication. It was due last week. They haven't responded to my email from two weeks ago about the delay. I'm concerned about managing my condition with this gap. I've tried calling the office twice but got voicemail both times. This is causing anxiety about keeping my health stable.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 184}
{"text": "Re: the issue from my last call, my referral for the medication refill has still not been processed. I was told it would be done by yesterday, but I'm still waiting. This is causing a delay in my treatment. I'm concerned about how this affects my health timeline.  I have a case number 789456 for reference. I need an update on when the approval will be completed.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 185}
{"text": "Over the past two weeks, I've been struggling with managing my chronic pain due to the lack of my prescribed medication. This started about a week ago when I tried to refill my prescription at the pharmacy and was informed that the medication is unavailable. Since then, I've been calling the pharmacy multiple times, but they keep saying they're waiting for restocking from the manufacturer. Last Thursday, I called the doctor's office to report this, and they said they're in contact with the pharmacy and will follow up by next week. I'm feeling increasingly anxious about how to manage my pain without the medication, and I'm disappointed that this issue isn't resolved yet. I've been trying to find an alternative medication, but that's adding to my frustration and confusion about what steps to take next.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 186}
{"text": "During the call, I was told that my appointment was canceled due to an administrative error on their end.  I'm disappointed that this happened so close to the date, especially since I've been trying to manage my condition on a tight schedule.  I'm anxious about how this will affect my treatment plan.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 187}
{"text": "Re: the issue from my last call, my medication isn't available, and I'm confused about the timeline for getting it. I was told it would be ready by last week, but I'm still waiting, and I'm getting frustrated. I have an appointment scheduled for next month, but I need my meds now.  Also, about the refill request I submitted in August, I'm disappointed there's been no update. I'm calling again because I need this resolved today.  Case #789-123.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 188}
{"text": "Re: the issue from my last call on October 26th,  I'm writing to follow up on the unexplained symptoms I mentioned during our conversation. I've been experiencing these symptoms for about a week now, and they're quite concerning. Despite waiting for your scheduled follow-up, I'm feeling increasingly frustrated and disappointed with the delay in getting answers. I'm worried that my condition might be worsening without proper guidance.  Could you please update me on the timeline for my appointment and any steps you're taking to address these symptoms? I'm anxious and confused about what's happening with my care.  Thank you for your help.  Sincerely,  [Patient Name]", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 189}
{"text": "On the patient portal, the status shows my appointment was canceled without notice. I'm confused and anxious about how this happened. I'm also feeling frustrated and disappointed that they didn't inform me.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 190}
{"text": "I'm calling today regarding my sister-in-law who is having symptoms return after her recent treatment. She had been doing well, but now she's complaining of persistent fatigue and occasional dizziness. I'm worried that this might indicate a setback in her recovery, and I wanted to bring it to your attention. She mentioned this started about a week ago, and it's been bothering her quite a bit. I'm not sure what to expect or if we need to schedule another appointment soon. I've been trying to help her keep track of her symptoms, but it's frustrating not seeing improvement. I'm anxious about how this will affect her upcoming follow-up and her overall treatment timeline.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 191}
{"text": "I checked the portal this morning and noticed that my upcoming appointment on October 15th for the physical exam has been unexpectedly canceled. I'm disappointed to hear that Dr. Evans' schedule was fully booked that day, and there's no new information on when it can be rescheduled. I'm anxious because I was counting on this visit to discuss my recent blood test results. The portal doesn't show any details about the cancellation, which is confusing. I'm frustrated that I don't have a clear timeline or alternative date. I'll need to call the office to get this resolved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 192}
{"text": "On the patient portal, the status shows no available appointments for my scheduled follow-up. I'm checking again later, but I'm getting frustrated that I can't find an opening. I need this sooner.   Thanks,  [Parent Name]", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 193}
{"text": "Following up on the request from last week, I'm calling regarding the denial of the insurance claim for my mother's treatment on October 5th. The explanation provided was unclear, and I'm still confused about why it was denied. My frustration is growing as this is causing delays in her care. I referenced case number 78945 for this matter.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 194}
{"text": "During the call, I was told the dosage should be taken twice daily, but the instructions on the prescription said once a day. It's really confusing, and I'm worried I might be giving the wrong amount.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 195}
{"text": "I'm writing on behalf of my father. He's been having worsening symptoms recently, and I'm really frustrated with how things are progressing. His condition has been declining faster than expected, and I'm struggling to keep up with the necessary steps. I'm worried that the current treatment plan isn't working effectively, and I've had trouble getting timely updates from the pharmacy regarding his medication refills. This lack of communication is causing me confusion about what to expect next, and frankly, I'm disappointed with the overall support we're receiving. I need to ensure his needs are being met promptly, but I'm finding it increasingly difficult to manage everything on my own.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 196}
{"text": "I'm calling about my mother's prescription billing. During the call, I was told there was a discrepancy with the charges, and I'm really confused about how that happened. They said the system flagged it, but I don't understand why, and I'm anxious because I need to get this resolved quickly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 197}
{"text": "I checked the portal this morning and I was disappointed to see that my prescription renewal hasn't been processed yet. I'm looking forward to getting my refill this week.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 198}
{"text": "Summary: The discharge instructions provided to the patient are unclear, leading to confusion about medication management and follow-up care.  Details: The patient is experiencing anxiety due to not understanding the refill process for prescriptions.  What happened: The caregiver attempted to clarify the instructions via phone but the patient remains uncertain about the timeline for next appointments.  Resolution: The issue is still unresolved and requires further communication with the healthcare team.  Patient age: Adult", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 199}
{"text": "I'm contacting you for my mother. I've been trying to get her test results for weeks now, and it's really frustrating. The portal keeps saying they're available, but I can't access them, and I'm worried about her treatment timeline. I called yesterday, and they said it would be sent, but it hasn't arrived yet. This is causing confusion and making me anxious about her care. What can be done to resolve this quickly?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 200}
{"text": "Since my appointment earlier this month, I've been feeling much better, but now my symptoms are returning. This started about a week ago when I noticed increased fatigue and dizziness. I'm anxious about this because the last visit was supposed to resolve everything, but I'm not sure what's happening now.  On Monday, I felt fine after the appointment, but by Thursday, the dizziness returned. I tried resting and drinking more water, but it hasn't gone away. My case number is 456789, and I'm worried about how this affects my treatment timeline.  I've been following the advice given, but I'm confused if I'm doing everything right. I'm disappointed that the relief wasn't permanent, and I'm anxious about needing another visit soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 201}
{"text": "Over the past two weeks, I've been feeling increasingly unwell with persistent fatigue and dizziness, but the doctor couldn't pinpoint what's wrong. Last Thursday, I went in for a series of tests, and while they seemed to be going well, the results came back inconclusive. I'm so confused about why I'm still feeling this way and what more we need to do. It's frustrating to not have any answers, and I'm anxious about how this is going to affect my daily life. The doctor mentioned they might need to consult a specialist, but I don't know when that will happen or what the next steps are.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 202}
{"text": "Since my appointment earlier this month, I've been feeling quite anxious about my recent test results. During my visit, the doctor explained that I needed a repeat test because my levels had changed slightly since my last check-up last year. I scheduled it for this Thursday, but when I tried to access the portal to review my records, I couldn't find the confirmation email. I'm disappointed that the portal seems inconsistent, especially since I rely on it to track my health updates. Over the past two weeks, I've been monitoring my symptoms closely, but the uncertainty has caused me frustration. I called the office yesterday to confirm the date, and they assured me the test is still scheduled, but I'm still worried about potential delays. I'm anxious to get the results so I can understand if this is part of my treatment plan or if further action is needed. It feels like my case is being handled inconsistently, which adds to my disappointment. I'm hoping for a clearer timeline from the staff.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 203}
{"text": "Last Thursday, I received a billing statement for my recent visit, and I noticed an unexpected charge of $120 for a 'consultation fee'. I was confused because my appointment was for a routine check-up, and I don't recall any additional services being discussed. This started about a week ago when I called the office to clarify, but the representative couldn't provide details on the charge. I asked for a breakdown, but they only offered to send an email with a summary. I'm frustrated because I feel the billing process lacks transparency, and I'm worried about unexpected costs in the future. The office mentioned it was a standard fee, but I still don't understand why it wasn't included in my initial estimate. I'm trying to resolve this by requesting a call from the billing department next week, but I'm anxious about the timeline and when I'll get a resolution.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 204}
{"text": "On the patient portal, the status shows that the refill request for the patient's medication is still pending. I'm confused because the doctor's office confirmed the prescription was sent, but it doesn't reflect on the portal. This creates anxiety as the patient needs the medication urgently for their condition. I'm worried about the timeline and when this will be resolved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 205}
{"text": "The portal record for my visit shows that a repeat test is required, but I don't understand why. I'm confused about the instructions and when I need to get it done.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 206}
{"text": "I'm contacting you for my mother regarding her recent MRI results. The report mentioned some unclear findings, and I'm really worried about what this could mean. We've been waiting for weeks for a clearer explanation, and my mother is anxious without knowing what's going on. I called yesterday to ask for an earlier appointment, but they said it's still going to be a few days. I'm frustrated by the lack of communication and the long wait. It feels like they're not giving us enough information to feel prepared or even just informed. My mother is disappointed that we haven't received any definitive answers yet, and I'm angry that her concerns aren't being addressed promptly.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 207}
{"text": "Over the past two weeks, I've been struggling with persistent pain in my lower back, and it's really been affecting my daily life. This started about a week ago when I first noticed the pain while gardening, but it's been worse ever since. I called the clinic yesterday to refill my pain medication, but they said it would take a few days to process, and I was already running low. Today, I tried calling again and was told that the refill is still pending, which has left me feeling frustrated and disappointed. I'm worried that the pain might worsen, especially since I have to walk around the house a lot these days. I'm confused about why the refill is taking so long, especially since I'm on a fixed income and can't afford to wait any longer without my meds. I'm starting to feel anxious about managing the pain until it gets resolved.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 208}
{"text": "One issue: I'm concerned about the delay in renewing my mother's prescription. She's on a fixed schedule and this is causing anxiety. When can we expect it to be processed?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 209}
{"text": "Following up on my last appointment for my chronic condition. I'm still having the same symptoms and I'm really worried. The last visit was in March, and I haven't seen much improvement. I'm feeling frustrated and anxious about my health right now. I need to get this sorted out soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 210}
{"text": "After the visit, I've been feeling much better, but about a week ago, my symptoms started creeping back in. I was worried sick, especially since I had just finished my treatment. It's frustrating to think I might need another round of meds. I'm hoping I can get in for a check-up soon to figure things out.  I called the clinic last Tuesday to discuss this, but they couldn't schedule an appointment until next month. That seems too long, especially with how anxious I am right now. I'll have to follow up again if this drag continues.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 211}
{"text": "On the patient portal, the status shows that the missed medication instructions haven't been addressed yet. I'm really frustrated and angry because my elderly father keeps missing these important doses, and I'm confused about why the instructions aren't clear. It's causing me a lot of anxiety, and I'm disappointed that we haven't resolved this properly. Could you please update the portal or call us to clarify what needs to be done?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 212}
{"text": "Summary: We're experiencing a delay with the prescription renewal for the medication.  The pharmacy informed us that it will not be available until next month.  This is causing concern as the patient requires the medication regularly.  Please advise on how to proceed or if there are alternatives.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 213}
{"text": "I'm writing on behalf of my father regarding the recent billing statement I received. I'm anxious because I'm unclear about who is responsible for payment. He's on Medicare, but the explanation wasn't clear. I called the pharmacy yesterday, and they couldn't resolve it, which is frustrating. I need to understand this quickly as it affects his medication coverage. What steps should I take next?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 214}
{"text": "Last Thursday, I called the pharmacy to refill my prescription for my chronic condition. The operator said it would take about a week, which seemed reasonable since I had done this before. But now, it's been ten days, and I'm still waiting. I called again yesterday, and they apologized but couldn't provide a new timeline. I'm confused about why the wait is so long, especially since my appointment was just last month and I need this medication to manage my symptoms. The frustration is building because I'm running low and my doctor's office is now involved, but they haven't offered any resolution. This has left me feeling angry and disappointed that the system isn't working properly for me. I'm worried about my health deteriorating while I wait, and I'm anxious about what will happen next.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 215}
{"text": "Following up on the request from last week, I'm still confused about who is responsible for the payment for my daughter's treatment. I was told one thing over the phone, but now I'm getting conflicting information. It's causing a lot of anxiety for our family as we're trying to manage everything.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 216}
{"text": "Last Thursday, I called to schedule the follow-up appointment after my husband's recent check-up, and the nurse confirmed everything was fine, which made me feel a bit anxious because he had been struggling with his arthritis flare-up. Over the past two weeks, his condition improved significantly, and we even thought we were on the path to managing it better. But then last Tuesday, his knee started swelling again, and he woke up in pain, which is frustrating because we just adjusted his medication a week ago. I'm confused about why it's flaring up now, and honestly, I'm angry that the specialist hasn't been able to provide a clearer plan. I called again today, but they still haven't scheduled the referral to see a rheumatologist, leaving me disappointed and worried about his worsening mobility.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 217}
{"text": "One issue: I'm confused about the new treatment plan changes. It seems rushed, and I'm anxious about how it will affect my recovery timeline. Could you clarify the details and the reasons behind this adjustment?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 218}
{"text": "I'm writing on behalf of my father, who is an adult and lives with me. He recently had a test done, but I haven't been able to get the results yet, and I'm really frustrated because it's been over a week now. I've tried calling several times, but no one answers, and when I do reach someone, they don't give clear answers about when the results will be available. I'm worried about his health, and this lack of communication is causing confusion and anxiety. I've asked the clinic multiple times for an update, but I keep getting delayed responses. It feels like they're not taking this seriously, and I'm disappointed that it's taking so long. I need to understand what's going on and when I can expect to see the results.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 219}
{"text": "Re: the appointment on June 15th, I'm calling to cancel my scheduled medication refill because I had to make a last-minute trip. It's unfortunate I couldn't reschedule earlier, and I'm disappointed about the delay.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 220}
{"text": "Following up on the request from last week, I'm still waiting on the results for the unclear imaging findings. I'm a bit frustrated because it's been over a month since the test was ordered and we're running behind schedule. The case number is 789-2024.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 221}
{"text": "To clarify, I understand you're asking about the delay in your father's lab results. We're working on it and expect them by Friday.   I know waiting can be frustrating, but we're prioritizing this for him.   He's doing well otherwise, and we're monitoring his symptoms closely.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 1}, "id": 222}
{"text": "One issue: I'm experiencing long wait times for my appointment, which is causing confusion and frustration.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 223}
{"text": "Since my appointment earlier this month, I've been trying to get a referral to a specialist for my ongoing knee pain. The doctor mentioned it would be handled through the portal, and I received an email with instructions. Last Thursday, I submitted the referral request, but I haven't heard back from the specialist's office yet. I called the front desk twice, once on Monday and again yesterday, and was told they were still processing my referral. It's been over two weeks now, and I'm starting to worry about delays. I'm feeling quite frustrated and disappointed because this has been bothering me for months, and I just want to get it resolved. I've even tried checking online for alternative options, but nothing seems to be moving forward quickly. I'm anxious about finding another solution soon.  I also received a letter in the mail a week ago with a new case number, but I haven't gotten any updates since then. I'm confused about why there's a case number if they're not communicating effectively. I'm definitely not satisfied with the current process and hope someone from the portal can help me understand what's going on. ", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 224}
{"text": "The nurse said, \"You need to take it with food to reduce nausea, but the instructions didn't mention that.\"  I'm just confused about what I should really do.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 225}
{"text": "Last Thursday, I received the initial letter from the insurance company, and they denied the claim without providing a clear explanation. I immediately called their customer service line on Tuesday, and after waiting on hold for over an hour, I was transferred to a representative. They couldn't provide any specific reasons for the denial and kept asking for information that was already included in the submitted claim. I’m now worried about how this will affect my father's treatment timeline, as he’s an elderly patient who needs this medication urgently. I’ve been trying to get a clearer answer ever since, but I keep getting deferrals to different departments.  This started about a week ago when I first contacted them, and I still haven’t received any resolution. I’m really angry about the lack of communication and the delays in getting this sorted out.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 226}
{"text": "Here are the main points: My symptoms haven't improved since starting the treatment two weeks ago. I'm feeling frustrated because my condition is worsening. I'm anxious about continuing the current plan without seeing results. I want to discuss changing the medication during our next appointment. ", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 227}
{"text": "Re: the issue from my last call, I'm calling again because I'm still confused about the specialist not accepting my referral. I thought they would be accepting it by now, given the timeline they mentioned last week. I'm anxious because this has been going on for over two weeks, and my case number is 15893. I need clarification on when this will be resolved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 228}
{"text": "Last Thursday, I was calling to schedule my annual check-up, and the nurse confirmed that my records were up to date. But yesterday, I received a notice in the mail stating that some documents were missing from my patient portal. Since then, I've spent hours trying to figure out what might be missing and how to get them back. I logged into the portal several times, but the page just shows a generic message that documents are incomplete. I'm confused about which specific documents are missing because the portal doesn't specify. I called the office this morning, and they said it could be a technical issue, but I'm anxious because I thought I had uploaded everything after my last visit last year. I've been checking online help resources, but nothing seems to help. It's frustrating that I can't access my health information easily, and I'm worried about delays in my care.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 229}
{"text": "Re: the insurance approval for my medication from last week, I'm still waiting on a decision. I called on August 15th and haven't heard back. This is getting frustrating, and I'm confused about when to expect it.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 230}
{"text": "One issue: My follow-up appointment was supposed to be next week, but I haven't received the confirmation email or heard from the office. I'm anxious about the delay.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 231}
{"text": "On the patient portal, the status shows that my insurance coverage is pending review, but I'm confused because I thought this was resolved last month. I've checked my account details, and there's no update on why it's still pending. I'm worried about how this affects my upcoming appointment next week and any potential delays in treatment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 232}
{"text": "Following up: I'm calling because I missed the instructions for my medication refill. The directions were confusing, and I'm worried I might be doing it wrong. I've been disappointed before with the clarity, and I'm feeling frustrated. Can you clarify when and how to take the pills?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 233}
{"text": "Last Thursday, I started noticing unusual fatigue and a persistent headache that I didn't have before. Since my appointment earlier this month, I've been keeping a symptom diary, and it's been concerning because these new symptoms don't align with my diagnosed condition. I called the office yesterday to schedule a follow-up, but the nurse mentioned they're backed up, and I won't get a same-day visit. I'm frustrated because my symptoms are worsening, and I feel like my concerns aren't being addressed promptly. I'm worried this might indicate something else entirely, which adds to my confusion and anxiety.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 234}
{"text": "What happened: They've been waiting over a month for my referral approval. I need this to get into treatment sooner.  Details: They said it's taking longer than expected due to delays in the system. I've followed up twice already but still no update.  Here are the main points: 1. My referral is overdue by 28 days. 2. No clear timeline provided for when it will be processed. 3. This delay is causing significant anxiety and confusion about my treatment plan.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 235}
{"text": "The receptionist told me that my insurance claim was denied, but I thought I submitted everything correctly. What should I do now?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 236}
{"text": "One issue: The insurance claim for the prescription was denied. I'm frustrated and disappointed because it's causing delays for the patient's treatment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 237}
{"text": "What happened: My son's symptoms have worsened significantly since his last appointment, including severe pain and difficulty breathing. He called yesterday, and I'm worried we're not getting the help we need. I've been trying to schedule another visit but the office keeps putting me on hold for too long. This delay is causing me a lot of anxiety.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 238}
{"text": "The portal record for my visit shows that the refill request was denied, but I’m confused because I thought I submitted all the necessary information. I’m frustrated because this is the second time this has happened, and I’m angry about the lack of clear communication. However, after checking with the office, it turns out there was a misunderstanding on their part, and everything is resolved now.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 239}
{"text": "Quick question: I'm a bit disappointed but wanted to check if there was any update on my son's recent blood test results? He's been waiting for a while now.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 240}
{"text": "During the call, I was told that the referral approval is still pending and there's no new update.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 241}
{"text": "I'm contacting you for my mother regarding her recent blood test results. I'm really anxious because it's been over a week now and we haven't received any update. I'm confused about when exactly we should expect them and frustrated that the portal isn't showing anything. I called the office yesterday, but they couldn't provide a timeline either. This is so disappointing, and I'm worried about the delay in getting her treatment started.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 242}
{"text": "Last Thursday, I called the specialist office to schedule a referral for my sister, who has been struggling with her chronic back pain. The nurse was very helpful, and I got all the necessary information. This started about a week ago when she mentioned that her current pain management wasn't working, and we were hoping for a second opinion.   On Monday, I received a call from the specialist's office saying that due to a full schedule, they were not accepting any new referrals at the moment. I was disappointed to hear that, especially since my sister's condition has been worsening. I asked if there would be a wait time or if they could provide a referral to another specialist, but they declined.   The next day, I called again and was put in touch with the office manager. I explained the urgency and that my sister has a history of severe pain episodes. The manager apologized and said they were looking into options, but ultimately, they informed me that they would not be accepting the referral. I felt frustrated and anxious about my sister's care, but I understood that I had no choice but to seek other options.   By Wednesday, I had found another specialist willing to see my sister. I called the original office again to confirm they were still not accepting referrals, which confirmed my disappointment. Despite the setback, I was able to get the appointment scheduled with the new specialist, and my sister is scheduled for a follow-up in two weeks.   Looking back, it's been a bit confusing navigating the system, but I'm relieved that we found a solution.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 243}
{"text": "Checking on something: I'm confused about my mom's symptoms getting worse. She's frustrated with how slow things are moving. I'm worried.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 244}
{"text": "Following up on the request from last week, I'm calling regarding the insurance coverage issue for the upcoming refill. I've been trying to get this sorted, but there's some confusion about the prior authorization. The office called yesterday, and it seems there might be a problem with the claim being submitted correctly. I'm a bit disappointed that this is taking longer than expected, and I'm confused about what exactly needs to be done next. I've got a case number 78945 for reference, if that helps.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 245}
{"text": "The nurse said, \"I'm sorry, but it looks like there's a discrepancy with the insurance coverage for the refill. Can you please bring in the prescription form filled out by your doctor?\"", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 246}
{"text": "I'm really concerned about the delay in receiving my test results. It's been over two weeks now.  I've tried calling the lab twice but got disconnected both times.  This uncertainty is causing me a lot of anxiety, especially since my symptoms haven't improved.  I need to understand why there's such a backlog and what steps I can take to get an update.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 247}
{"text": "The portal record for my visit shows a billing discrepancy that I didn't authorize. I'm frustrated and disappointed to see this charge appear unexpectedly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 248}
{"text": "The receptionist told me that the insurance claim was denied, and we're not sure when we'll get the funds.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 249}
{"text": "What happened: I recently completed my treatment, but I'm confused about the next steps. There was no clear guidance provided during or after the last visit. I'm worried about managing my health without specific instructions. This lack of direction is causing me anxiety.  ", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 250}
{"text": "Last Thursday, I called the office to schedule my follow-up appointment for my elderly mother, who has been dealing with chronic back pain. The secretary said the earliest available date was in three weeks, but that seemed too long given her worsening symptoms. Confused by how a routine check-up could take so long, I asked if there was any possibility for sooner availability. They explained that all specialists are booked solid for the next month, which left me feeling anxious and uncertain about her care. By the end of the day, I was even more disappointed as they suggested a referral might be needed, adding more steps to an already frustrating process. I left the call feeling overwhelmed and worried about her declining health.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 251}
{"text": "I checked the portal this morning and I'm still waiting for post-treatment instructions. The last update was from last month, and it doesn't cover what to do now that the treatment is done. I'm really confused about when to schedule my next appointment or if I need to watch for any specific symptoms. This lack of guidance is frustrating, especially since I'm supposed to be helping my sister manage this. Maybe we're missing something important here.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 252}
{"text": "Over the past two weeks, I've been dealing with some lingering symptoms that have returned after my treatment. Since my appointment earlier this month, I've been monitoring how I feel, and I noticed the fatigue and mild pain started creeping back in about a week ago. I'm a bit anxious about this, but I'm also satisfied that I'm being proactive by keeping track of these changes and planning to reach out to my doctor soon.  Timeline: - Two weeks ago: Symptoms began returning after treatment. - One week ago: Noted increased fatigue and mild pain.  I'm hopeful that this can be addressed promptly.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 253}
{"text": "I'm following up for my sister, who had her blood tests done a week ago and hasn't received her results yet. I'm really confused about the timeline because the doctor said it would take 3-5 days, but it's been longer. I called the lab yesterday and they mentioned there was a backlog, but I'm still worried about her health. She's been feeling off lately, and I can't help but feel frustrated that we're waiting in the dark. When can we expect the results? I'm trying to help her, but I'm confused about what to do next.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 254}
{"text": "Need clarification: I'm calling regarding the delay in my referral approval. I was referred for a specialist appointment scheduled for next week, but haven't received the approval confirmation yet. I'm frustrated and angry because this delay is causing anxiety and confusion about my treatment timeline. Can you please provide an update on when the referral will be processed? I'm disappointed with the ongoing uncertainty.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 255}
{"text": "I checked the patient portal this morning and saw that the treatment hasn't been improving the symptoms at all. The last update was from last week, and I'm still dealing with the same issues. I'm really frustrated because this is taking too long, and the patient is elderly, so we need this resolved quickly. I've been calling the pharmacy multiple times, but nothing is showing up. I'm angry that the resolution is delayed, and I feel like we're stuck in a loop with no progress.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 256}
{"text": "I'm messaging for my mother who has been waiting for a refill on her medication for over a week now, and it's causing her a lot of discomfort. I've tried calling but keep getting voicemails. I'm really frustrated and disappointed that this isn't being resolved promptly. The portal keeps showing delays, but no clear timeline for when it will be fixed. I'm concerned about her condition worsening due to lack of proper medication management.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 257}
{"text": "Details: I've been waiting for a callback from the scheduling department for over a week now. They promised to contact me by Friday, but nothing has come through. This long wait is causing me anxiety about my upcoming appointment. I'm worried the delay might affect my treatment timeline. ", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 258}
{"text": "Following up on the request from last week, I'm still waiting for the test results. I'm really frustrated that we haven't received them by now, especially since my symptoms haven't changed. I need some clarity on what's going on.   Also, I wanted to mention that my appointment was scheduled for October 15th, but I'm still confused about the next steps regarding my unclear diagnosis. This is making me feel quite angry and disappointed with the progress.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 259}
{"text": "I'm calling on behalf of my niece, who had an urgent appointment scheduled for today at 2 PM, but unfortunately, due to an unexpected personal emergency, she was unable to attend. I understand this is without notice and apologize for the short notice, but we are rescheduling as soon as possible. I've already tried contacting the office earlier this morning, but the receptionist was unable to assist, so I wanted to reach out directly to confirm the next available date. I'm happy to provide any additional information needed to facilitate this process. Thank you for your understanding and assistance.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 260}
{"text": "Summary: The imaging results show unclear findings that need further review. Details: I'm confused about what this means for my mom's treatment. Here are the main points: She's been waiting a week for a clearer explanation.  I'm frustrated by the lack of updates on the timeline. Anger: I feel let down by the inconsistent communication.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 261}
{"text": "Re: the issue from my last call on July 12th, I'm still waiting on my prescription refill. The pharmacy called saying they couldn't process it, but I haven't heard back from anyone. I'm anxious about running out of medication and confused about why this is taking so long. I've been disappointed with the delays and frustrated that nothing is being resolved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 262}
{"text": "During the call, I was told that my prescription was already filled, but I haven't received it yet. I'm calling because I need a refill and I'm starting to run out. They mentioned it might be sent by mail, but I'm anxious about the timing since I have a refill scheduled for next week.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 263}
{"text": "What happened: Patient reported persistent pain despite last month's treatment adjustment. I'm concerned about the lack of improvement and worried about their daily functioning. Scheduling a follow-up appointment for next Tuesday to reassess treatment plan. They seem anxious about managing pain without clear resolution.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 264}
{"text": "Over the past two weeks, I've been feeling much better after my treatment for my chronic back pain, but now the symptoms are returning. I started feeling worse on Monday, which is when I realized I needed to reach out again. I called the office last Friday, and they said they'd schedule an appointment, but I haven't heard back yet. I'm really anxious about my condition worsening again, and I'm frustrated that my concerns aren't being addressed quickly. It feels like they're not taking me seriously, and that makes me angry. I'm disappointed in the care I'm receiving, and I don't feel satisfied with the progress we're making.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 265}
{"text": "I'm writing on behalf of my father regarding the recent denial of his insurance claim. I've been trying to understand why it was denied and what steps we can take. The explanation provided was quite confusing, and I'm feeling frustrated because this has caused a delay in his treatment. However, I'm satisfied that we are now working with the insurance company to resolve this issue promptly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 266}
{"text": "I checked the patient portal this morning and noticed that the refill request for the patient's hypertension medication hasn't been processed yet. The last time this happened, the portal message was confusing, and I'm worried about the patient's blood pressure control. The portal shows the refill is still pending, but there's no clear timeline on when it will be completed. I'm confused about why this is taking longer than usual and anxious about the patient's access to their medication.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 267}
{"text": "What happened: My prescription for medication was supposed to be filled by today, but it's not available at the pharmacy. I've been waiting for several days and have no alternative options. This is causing me significant difficulty with managing my condition. I need to speak with someone about this issue.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 268}
{"text": "This started about a week ago when I received my referral for physical therapy. I was told by the pharmacy that they would process it immediately, but it still hasn't been approved. I called their support line on Monday, and they said it was being reviewed but didn't provide a specific timeline. Today is Friday, and I'm confused because I thought my appointment was scheduled for next week, but now I'm worried it might be delayed. I don't understand why there's no update, and it's causing anxiety about my treatment plan.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 269}
{"text": "I'm calling today about my husband's prescription refill. We've been trying to get this sorted out for weeks now, and it feels like we're running into roadblocks every time. I've already sent the request twice through the portal, but nothing has been processed. I'm confused about why it's taking so long, especially since we need his medication consistently. The last time this happened, we had to wait almost two weeks for a phone call, and that caused a gap in his treatment. I'm disappointed in how things are handled here. It's frustrating to keep getting these mixed signals, and I'm starting to feel anxious about his health because of it all.  I've looked at his case number, 789-456, and the dates associated with his last refill and the current request. I'm confused about the timeline and when we should expect the next update. I need clarity on this so we can plan properly. I'm calling today because we're running out of options and I need someone to help resolve this quickly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 270}
{"text": "The medication you requested is currently unavailable at our facility.  We understand this may cause confusion regarding your treatment plan.  We are working to refill with an alternative option as soon as possible.  Please contact us if you have any questions or concerns about this delay.  We apologize for the inconvenience this may cause.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 271}
{"text": "Quick question: I'm a bit confused about the discharge instructions for my dad. The instructions seem unclear, and I'm worried about managing his condition at home. Could you clarify the dosage and timing for his medications? Also, when will we know if everything is okay? I'm feeling frustrated and anxious about this.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 272}
{"text": "To clarify, I'm disappointed we still haven't received the updated forms needed for the portal. There's been a delay in getting the documents refilled. I'm feeling frustrated with the ongoing confusion about the missing items. This lack of progress is causing anxiety about our upcoming appointment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 273}
{"text": "Hi [Provider Name],  I'm writing to follow up on the recent treatment I received. After my appointment on [Date], I've noticed my symptoms are returning, which is concerning. I'm feeling a bit anxious and frustrated about this delay in resolution. Could you please let me know what steps we're taking to address this?  Thank you, [Parent Name]", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 274}
{"text": "Since my appointment earlier this month, I've been trying to manage my diabetes better, but I'm really confused about the new diet plan. My doctor gave me a pamphlet, but the instructions are conflicting with what my mom used to tell me. This started about a week ago when I called the office to ask for clarification, and they said they would send a nurse to follow up. I'm supposed to get that call by Friday, but I haven't received any updates yet. I'm worried I might be doing things wrong, and it's causing me anxiety about my health.  On Monday, I started tracking my meals using the app my doctor recommended, but I keep getting confused about the carbohydrate counts. For example, yesterday I ate a piece of fruit that was supposed to be low-carb, but the app said it was high. I'm not sure what to believe now.  I called again on Tuesday to ask about the conflicting advice, but the nurse wasn't available, and I got another voicemail. I'm disappointed that they haven't prioritized getting me this information sooner, especially since I'm trying to be proactive about my condition. I just want to feel confident in managing this without constant confusion.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 275}
{"text": "The portal now says my recent blood test results are still pending, and I can't find any update since last week. I'm really anxious because I was told they would be available by now. I've tried calling the office, but every time I ask, they say they're working on it, but nothing changes on the portal. It's frustrating that I can't even see what's going on with my own records. I'm worried it might affect my treatment timeline, and I just want to know what's happening.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 276}
{"text": "I'm reaching out for my spouse. I'm calling because I just got a notice that some documents are missing from his patient portal account, but I don't understand how that could be since I uploaded everything last week. I'm confused about why they're saying they're missing if I just checked and they're all there. This is frustrating because we're supposed to have access to all his medical records online, but now I'm getting an error message and I don't know what to do. I'm angry that this is happening right before his appointment next week. I'm disappointed that the system isn't working properly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 277}
{"text": "Following up on the request from last week, I wanted to let you know that I'm still waiting for the updated medical records you mentioned. I've been checking my portal regularly and noticed that the documents are still missing. It's been over a month now, and I'm feeling quite frustrated about the delay. Also, regarding the referral noted in my chart for specialist consultation, I haven't received any updates on that either. Could you please provide a timeline for when these documents might be completed? I'm disappointed that this process is taking so long, especially since I'm a young adult and need this for my treatment plan.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 278}
{"text": "One issue: My symptoms improved but now I have a bad flare-up. What should I do? I'm really frustrated and anxious.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 279}
{"text": "I'm writing on behalf of my father. He's been experiencing some unexplained symptoms lately, and I'm really worried. He's having persistent headaches and fatigue, which isn't like him. I'm not sure what's causing it, and that confusion is making me anxious. We've been to the doctor a couple of times, but they haven't been able to pinpoint anything. The frustration is mounting because his condition isn't improving, and I'm angry about the lack of clear answers. I'm hoping for a better resolution soon, but it feels like it's been delayed again.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 280}
{"text": "I'm following up for my mother who is in her late 70s. She had her scheduled blood work done last Tuesday, but we haven't received the results yet. I called the clinic twice this week and was put on hold for nearly 20 minutes each time with no clear answer about the delay. The portal keeps showing \"Processing\" but nothing else. I'm worried about her condition and can't help feeling frustrated that we're still waiting in this limbo. The nurse I finally spoke to mentioned it might be due to a lab error but gave no timeline. My mother is anxious without clear information, and I'm getting more so with each passing day. I need to schedule a call with the doctor myself to get some resolution.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 281}
{"text": "Following up: I'm confused about the conflicting information I received from two different staff members regarding my appointment date. One said it's confirmed for next Tuesday, but another mentioned a possible change. I'm anxious because this affects my scheduling and I need clarity as soon as possible.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 282}
{"text": "I'm writing on behalf of my father, who has been struggling to reach his doctor for several weeks now. Despite multiple attempts to call and email, we keep getting voicemail or automated responses with no clear path to follow up. This is incredibly frustrating, especially since his condition has been worsening and he's feeling quite disappointed by the lack of communication. I'm worried about his health and unsure what steps to take next to ensure he gets the care he needs.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 283}
{"text": "Following up on the request from last week, I'm still waiting for the refill for my medication. I called the pharmacy on Tuesday, August 22nd, and they said they would process it by Friday, but nothing has been done yet. This is frustrating, especially since my doctor's office keeps referring to case number 55467. I'm anxious about my medication levels and disappointed in the delays. I need an update as soon as possible.  I've been dealing with this issue for two weeks now, and it's causing me a lot of stress. Could you please provide an estimated timeline for the refill?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 284}
{"text": "I checked the portal this morning and I'm still waiting for detailed post-treatment guidance. It's been over a week, and I'm feeling anxious about managing my recovery without clear instructions. I'm confused about when to return for follow-up and frustrated that the portal doesn't have this information yet.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 285}
{"text": "I checked the portal this morning and it showed that my insurance claim was denied. I'm confused about why that happened, especially since everything looked correct. I'm really anxious about how this will affect my treatment timeline.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 286}
{"text": "I just got a call from the pharmacy saying my prescription was sent to the wrong place, and they're out of the medication. The nurse said, \"Oh, that must be a mistake on our end.\" I'm really anxious about getting this filled, especially since I have to take it regularly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 287}
{"text": "I'm reaching out for my spouse. I received a call today saying that a prescription was sent to the wrong pharmacy. I'm confused about how this happened and anxious about getting my medication on time. What steps should we take to correct this?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 288}
{"text": "Summary: I'm experiencing new unexplained symptoms, including dizziness and fatigue, since my last appointment.  To clarify, these symptoms started about two weeks ago and have been worsening daily.  Details: I'm confused about how this could be related to my existing condition, as my last check-up was clear.  I'm feeling frustrated that I haven't noticed any changes before now.  Disappointment is setting in because I thought my treatment plan was effective.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 289}
{"text": "I'm following up for my brother who needs his medication refilled. We submitted the insurance approval request last week, but haven't received any update yet. This is frustrating because his condition requires timely treatment, and the delay could impact his health. I'm worried about the billing process now too, as we need to ensure coverage is in place. Has there been any portal update or communication from the insurance side? I'm trying to keep track of the case number, but it's confusing without clear timelines. Please let me know when the approval is processed.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 290}
{"text": "Summary: My adult child recently experienced unexplained symptoms. Details: They mentioned feeling unusual fatigue and dizziness over the past week. What happened: I'm concerned and wanted to share this update. I'm feeling frustrated as we're still waiting for answers from the doctor.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 291}
{"text": "On the patient portal, the status shows that the test results for my visit are still pending. I'm anxious because we haven't received clarity on the diagnosis yet, and it's been over a week. The doctor mentioned it might take longer, but I'm hoping for an update soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 292}
{"text": "On the patient portal, the status shows that there's a pending message from the office that hasn't been addressed yet, and I'm really disappointed and frustrated about it.  My case number is 12345, and I'd like to know when this will be resolved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 293}
{"text": "The receptionist told me that the treatment isn't showing improvement for my mother, and I'm really confused about what to do next.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 294}
{"text": "I'm writing on behalf of my father. He's having trouble accessing his portal account and keeps getting error messages. I'm confused about what's wrong and anxious that he can't manage his medications. The last time we tried was yesterday, and we're disappointed that we still can't get it to work. I'm frustrated that we haven't received any updates from anyone about this issue.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 295}
{"text": "Last Thursday, I received a call from the clinic scheduling the follow-up appointment for my treatment plan changes, but I was confused about the timeline provided. The new plan was supposed to start next Monday, yet the referral for a specialist was still pending from three weeks ago. I've been dealing with this condition for almost two years, and the constant adjustments make me anxious about the outcomes. After the visit, I called the office again because the medication dosage mentioned in the email didn't match what was discussed during the consultation. This discrepancy left me feeling frustrated and angry, especially since I rely on these details to manage my symptoms. I'm disappointed that the process isn't smoother, and I'm still waiting for the specialist referral to be finalized. It feels like we're moving in slow motion, and I'm left in the dark more often than not.  To give you a clearer picture of the timeline, let's look at the key dates: I first mentioned the need for treatment changes on October 15th during my last visit. The clinic called me on October 22nd to schedule the follow-up, which was set for October 30th. However, the specialist referral, ordered back on October 10th, hasn't been processed yet. This confusion is making it hard to plan my days, and the unresolved issues are causing me a lot of stress.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 296}
{"text": "Last Thursday, I received a letter from UnitedHealthcare stating my prescription for lisinopril was denied due to pre-existing condition coverage limitations, even though I've been managing hypertension consistently for five years. I immediately called their customer service line on Monday, where I was placed on hold for over 20 minutes before being transferred to a representative who couldn't explain the denial beyond saying it was 'standard procedure.' I'm confused about how this could happen when my primary care physician has documented my condition for years. I've already submitted the required medical documentation again via email, but haven't heard back in three days. This feels incredibly frustrating and unfair—especially since I rely on this medication to manage my blood pressure, and without it, I'm experiencing concerning side effects. I'm starting to worry about my health deteriorating further while waiting for resolution, which is causing me anxiety and deep disappointment in the system.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 297}
{"text": "Hi, I'm following up for my elderly father. I've been trying to get his recent test results from the hospital, but I keep getting delayed responses. It's frustrating because his doctor needs them to move forward with his treatment plan. I've called twice and even sent emails, but nothing. I'm disappointed we're still waiting after all this time. It seems like a simple request, but it's causing confusion and anxiety about his care timeline.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 298}
{"text": "The doctor said my test results might indicate a different approach, but the specialist thinks it's the same condition. I'm really confused and frustrated.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 299}
{"text": "Quick question: My son is experiencing side effects from his new medication. What should I do?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 300}
{"text": "I'm following up for an elderly relative. They've been struggling with their chronic condition management lately, and I'm worried about the refill for their medication. The last time we called, they said they would have the prescription ready, but it's still not processed. I'm starting to get frustrated because this is causing them discomfort, and I'm not sure what else to do.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 301}
{"text": "Last Thursday, I scheduled an appointment for a refill of my prescription, but the pharmacy informed me that my last visit was over a month ago and I needed to schedule a new consultation with my doctor first. I'm confused about why a simple refill requires a new doctor's visit, and I'm anxious about the delay in getting my medication. I tried calling the office back today to clarify, but I was placed on hold for 20 minutes and then disconnected, which is frustrating. My doctor's office didn't call back, so I'm stuck in this confusing loop with my medication needs.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 302}
{"text": "Hi, I'm calling today for my mother who is 35 years old. I've been trying to get a refill on her prescription for blood pressure medication for the past two weeks now, and I keep getting put on hold for ages with no one to speak with. The last time I called, I was told they would have it ready by Friday, but Friday came and went, and I haven't heard anything. I'm starting to get really anxious about her taking her medication on time, especially with her job requiring her to travel for work. I called again yesterday and was told it was sent out, but I haven't received the confirmation email or any tracking number. I'm getting frustrated because this is the third time I've called this week, and it feels like we're running in circles. I'm worried this might cause issues with her health, and I don't know what else to do. I'm supposed to call again tomorrow, but I'm already dreading it. I'm sorry to bother you, but I really need some resolution here.  Also, I wanted to follow up on the referral to the specialist for her chronic back pain. The nurse said they would send it over, but I haven't received anything yet. I'm confused as to why there's a delay, and I'm disappointed that her case number isn't being addressed properly. I'm trying to manage everything on my own, but it's overwhelming when things fall through the cracks like this.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 303}
{"text": "After the visit, I've been waiting for my lab results for what feels like an eternity, and it's really been building up my anxiety. My doctor said it would take about two weeks, but two weeks turned into three, and now it's been a week since that, so it's been three weeks total. I called the clinic last Monday to check on it, and the nurse said they're still processing it. I understand they're busy, but honestly, it's frustrating to not know my health status. I'm an elderly patient, and I've had other issues recently, so this uncertainty is making me feel quite disappointed. I even tried to check the portal myself, but I keep getting confused with the login details because I'm not very tech-savvy. Last Friday, I got a brief email saying they were working on it, but no actual update. I'm starting to worry that something might be wrong, and that's adding to my anxiety. Maybe I should ask for a callback next time I call.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 304}
{"text": "I'm contacting you for my mother. I'm confused about why her recent portal update hasn't been processed yet, and I'm getting frustrated with the timeline. The case number is 12345, and I expected this to be resolved by now, but it's still unresolved. I'm disappointed that this is taking so long.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 305}
{"text": "What happened: I'm trying to schedule an appointment for my grandson, but all slots are filled. He's been waiting for over a month now. I've called twice and been transferred multiple times. I'm confused about the timeline for the next available slot.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 306}
{"text": "Following up on the request from last week, the specialist I referred to is not accepting my referral. I'm confused about the timeline and frustrated with the lack of clarity. This is causing me a lot of anxiety.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 307}
{"text": "I checked the portal this morning and saw a message about conflicting reports from two specialists regarding my father's treatment plan. One doctor recommends surgery while the other suggests more conservative management. I'm confused about which path to take and worried about making the wrong decision for his health. The portal shows they are still discussing it, but I'm anxious and frustrated that we don't have clearer guidance yet. I called the hospital to ask for clarification but was told to wait for their joint decision which might not be until next week. This uncertainty is causing me a lot of stress as a parent.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 308}
{"text": "The pharmacist mentioned that my mother's symptoms have been worsening recently, and I was disappointed to hear that her refill request was denied due to the lack of a doctor's note.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 309}
{"text": "The nurse said, 'I'm sorry, but it seems there was a mix-up with your test results. They might be delayed.'", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 310}
{"text": "Regarding my previous message, I'm writing again about the delay in renewing my son's prescription. It was due for refill last week, and I've been calling the pharmacy since Monday. I'm anxious and frustrated because my father, who is elderly, relies on this medication daily. I'm confused why there's no update yet, especially since we have a case number 789567. Can someone please provide an update soon?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 311}
{"text": "The portal now says that the lab results for the recent blood test are delayed. I'm confused because they usually come back within a week, and it's been almost two weeks now. I'm frustrated that the delay isn't addressed yet, but I'm satisfied that the doctor assured me they're working on it and will update me as soon as they're available. The portal also shows a case number, 872-345, which I can use for follow-up if needed.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 312}
{"text": "One issue: I'm calling regarding my recent test results. The doctor ordered another round of blood tests, but I'm a bit anxious about why it's needed again. I've been keeping track of my symptoms, and they haven't changed much. I just want to understand the timeline for this repeat testing and if there's anything I should be doing differently in the meantime. I've tried to look it up online, but I got more confused. I hope to get this resolved soon as I'm feeling quite worried about repeating the process.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 313}
{"text": "During the call, I was told that my refill request for the hypertension medication was delayed due to a system update.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 314}
{"text": "The portal record for my visit shows that the patient's symptoms have not improved with the current treatment plan. I understand this may cause frustration and anxiety, especially given the timeline for the next scheduled appointment. We are currently reviewing options for a referral to a specialist, and I will update the portal once we have more information. In the meantime, if you have any questions or concerns, please contact the office directly.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 315}
{"text": "Appointment for June 15th has been rescheduled to July 20th.  This is the third time this appointment has been moved.  I'm confused about the ongoing changes and when this will finally be resolved.  This situation is frustrating and disappointing.  Please clarify the reason for the repeated delays.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 316}
{"text": "During the call, I was told that they're still missing some documents from the portal.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 317}
{"text": "During the call, I was told that my lab results are delayed and there's no specific date given yet.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 318}
{"text": "I'm reaching out for my spouse regarding the patient portal. They keep asking for documents, but I've already sent in the required ones. I'm confused about why they're still requesting them. This is frustrating and disappointing. I've been trying to resolve this for weeks, and it's causing a lot of anxiety. The case number is 789456, and they keep saying it's incomplete. I don't know what else to do.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 319}
{"text": "Need clarification: My doctor and specialist have conflicting opinions on my treatment plan. I'm confused about which one to follow.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 320}
{"text": "Following up: I wanted to let you know that my insurance coverage issue has been resolved. I'm satisfied with how quickly it was handled.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 321}
{"text": "Hi, this is Sarah, calling about my insurance coverage for the upcoming surgery. I'm calling because I received a letter recently from my insurance company dated October 25th stating there might be a gap in coverage due to some prior issues. I was wondering if you could help clarify this. Also, I saw in my chart that there was a referral dated September 15th for the specialist, and I wanted to make sure that was properly submitted. I'm a bit anxious because I've been trying to get this sorted out for a while now, and it feels like things are falling through the cracks. I'd appreciate an update soon.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 322}
{"text": "I checked the portal this morning and noticed my insurance coverage for the refill is still pending. I'm frustrated because I expected it to be processed by now, and it's causing a delay. This leaves me disappointed and anxious about when I can get my medication.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 323}
{"text": "I'm messaging for a family member in my care. They've been given different advice from two different doctors about their treatment. One says to start medication, the other says to wait. I'm worried and don't know what to do.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 324}
{"text": "They've been waiting for the referral approval for weeks now.  I'm anxious because this is affecting my work schedule.  The doctor mentioned it should have been processed faster.  I feel frustrated with the delays and uncertainty.  This is causing me disappointment as my condition might worsen.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 325}
{"text": "I checked the portal this morning and I'm still confused about my medication dosage. My prescription says 500mg, but my doctor called and said it should be 250mg. This discrepancy is causing me frustration, and I'm worried I might be taking the wrong amount. I need clarification as soon as possible.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 326}
{"text": "This started about a week ago when I noticed unusual symptoms after my appointment earlier this month. Since then, the doctor has ordered several tests, but we're still waiting on results. I'm feeling quite frustrated and disappointed because the timeline is unclear, and I can't seem to get any concrete answers. I called the clinic twice last week, but each time was referred to different people, making things even more confusing. I understand that some tests take time, but I'm an elderly patient, and this lack of resolution is causing anxiety. They mentioned it might be something common, but I still don't have a clear diagnosis or a plan moving forward. I just wanted to know what to expect next, but I haven't received much guidance. I'm worried about how this might affect my daily life without a clear direction.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 327}
{"text": "Summary: I'm calling about my prescription renewal. The refill is being delayed, and I'm confused about the timeline. My mother has been on this medication for her chronic condition, and I'm worried about the gap. The pharmacy said it might be due to insurance processing, but I don't understand why it's taking longer. She needs her medication now.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 328}
{"text": "I checked the portal this morning and saw that my appointment for the 20th was canceled without notice. I'm confused because I didn't receive any email or phone call about it. I'm disappointed that I wasted time trying to get there. I'm anxious about how this affects my medication schedule. The portal shows the cancellation was made yesterday afternoon by the pharmacy department. I'm confused why there was no prior communication and worried about the impact on my elderly mother's condition. I'm frustrated by the lack of notice and confused about the next steps. The portal indicates the cancellation was due to an administrative error, but I'm still confused and disappointed about the whole situation.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 329}
{"text": "I'm messaging for my mother who has Alzheimer's. I recently received a billing statement that included a charge for a service I didn't authorize. I'm confused why this would appear and concerned about the accuracy of the bill. The charge was unexpected and doesn't match any recent treatments or services we received. I'm trying to understand what happened but the billing department's explanation wasn't clear. This situation is frustrating and adds to our stress about managing her care.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 330}
{"text": "Since my appointment earlier this month, I've been waiting for my test results from the lipid panel. I called the lab on Monday to ask about the timeline, and they said it should be ready by Friday. But when I logged into the patient portal today, the results haven't appeared yet. I'm starting to get really frustrated because I need to make decisions about my treatment based on this information, and the lack of communication from both the lab and the clinic is causing confusion. I'm worried about my health timeline and when I'll finally get clarity.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 331}
{"text": "I'm contacting you for my mother regarding the recent billing statement I received. I'm confused about who is responsible for paying for her ongoing treatment since she's been discharged. The statement says 'patient responsibility', but I thought the hospital was handling the insurance part. I called them yesterday, and they transferred me to billing, but I haven't heard back. I'm worried about getting the bill wrong or missing something important. Could you clarify what exactly is expected from us now that she's home? I'm trying to keep track of everything, but this is overwhelming.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 332}
{"text": "Re: the issue from my last call on 10/15, I'm still waiting for clarification on who is responsible for this payment. It's causing a lot of anxiety and frustration, and I'm disappointed the resolution is delayed.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 333}
{"text": "I'm writing on behalf of my father. He was supposed to be feeling better after his treatment, but recently he's started complaining of chest pain and shortness of breath again. I'm really worried because this is the same symptom that brought him to the hospital before. The doctors said it would take a few weeks for him to fully recover, but now it feels like things are slipping back. I've been trying to schedule a follow-up appointment, but the office keeps saying they're booked solid. My father is having a hard time with this, and I'm feeling anxious and frustrated about not being able to get him the help he needs sooner. I'm hoping you can help us understand what's going on and when we might expect an improvement.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 334}
{"text": "On the patient portal, the status shows my insurance approval for the medication is pending, but I was told by the office it should have been approved already. I'm confused why there's a delay and frustrated that I'm still waiting. The portal doesn't show any reason for the delay or a timeline for when it will be processed. This is causing a lot of anxiety for refilling my prescription.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 335}
{"text": "What happened:  I'm confused about the discharge instructions, especially when to return for follow-up. The written materials were unclear. I called the clinic twice but couldn't get a clear answer. I'm frustrated because this is affecting my ability to care for my brother properly.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 336}
{"text": "One issue: The specialist I was referred to is not accepting new patients. I'm disappointed and anxious about finding another specialist. Any advice?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 337}
{"text": "On the patient portal, the imaging results are listed as \"unclear\" and they're asking for a follow-up appointment, but I haven't received any instructions yet. I'm really disappointed that they couldn't provide more details. This is frustrating and makes me anxious about what might be going on.  I'm a caregiver for my adult son, and I'm supposed to schedule the refill for his medication, but the portal shows the prescription is still pending. I'm confused about why it's not processed yet.  I'm still waiting on the portal for the updated imaging report that was supposed to be available yesterday. This delay is causing me a lot of worry.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 338}
{"text": "Re: the issue from my last call, I'm still having trouble accessing my portal and I'm confused about what needs to be done. I called on August 15th and haven't received any updates. This is causing a lot of anxiety for me to keep track of my own care.  I've tried following the instructions, but I keep getting errors. Could you please provide more detailed guidance or let me know if there's a specific case number I can reference?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 339}
{"text": "Checking on something: I'm calling regarding the insurance approval for the medication my patient needs. It's been delayed, and I'm concerned about the timeline. I've already submitted all the necessary documentation, but haven't received an update. I'm starting to feel frustrated and disappointed with the process. Can you please check the status and let me know what's holding it up?  Patient's case number is 123456, and they're a young adult. I need this resolved as soon as possible.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 340}
{"text": "The pharmacist mentioned that the refill took longer than usual because there was a delay in the system updating the prescription.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 341}
{"text": "The nurse said, 'Your father is having some side effects with the new medication. It might be causing his stomach to upset, but we can adjust the dose if needed.'", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 342}
{"text": "Need clarification: I'm confused about the insurance approval for my medication refill. They denied it, but I'm not sure why. This is frustrating and causing delays in my treatment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 343}
{"text": "The portal now says I need to provide additional documents for my recent visit. I'm missing the consent form and the lab results request. I've been trying to get these together, but it's proving more difficult than I expected. My mother relies on me to handle all of this, and I'm anxious about the delays. I've looked everywhere for the forms, but they don't seem to be in my files. This is frustrating because I want to make sure everything is in order as quickly as possible. I'm disappointed that this is taking so long, especially since my mother's case is time-sensitive. I'll keep looking, but I'm worried about the timeline.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 344}
{"text": "What happened: My appointment was rescheduled three times due to scheduling conflicts. I've been trying to coordinate my schedule but keep getting pushed back. Each delay adds to my confusion about the timeline. I'm disappointed with how this is unfolding.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 345}
{"text": "This started about a week ago when I noticed my mother was having more difficulty breathing. On Monday, she seemed especially tired and mentioned chest pain, which was new. By Wednesday, she was complaining of a persistent cough and fever. I called the clinic yesterday, but the nurse couldn't give a clear answer about what was wrong, just said to monitor her symptoms. I'm really frustrated because we're waiting for a specialist referral, and my mom is getting more anxious every day.  Last week, I took her to the ER because her symptoms were worsening, but they couldn't find anything wrong. Today, she's still complaining, and I'm worried about her condition.  I'm feeling angry and disappointed that the tests haven't shown anything, even though she's clearly not herself.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 346}
{"text": "I checked the portal this morning and I can't find any available appointments listed for my scheduled follow-up. I'm supposed to have a visit scheduled for next Tuesday, but it doesn't appear on the calendar or in my messages. I'm getting a bit confused about what's going on, and I'm not sure if I should call to confirm or if everything is just updated online.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 347}
{"text": "The nurse said, 'Your symptoms are still bothering you, right?'", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 348}
{"text": "I had a really good response to the treatment last week, but now I'm having a bad flare-up.  I'm confused about what's causing the change and if it's normal.  I'm worried this might mean the treatment isn't working properly.  I need to understand what we should do next.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 349}
{"text": "The treatment hasn't been helping my symptoms at all. I've been following the instructions exactly as given. I'm starting to feel like we're not making progress. This is frustrating and worrying me. I need to understand what's going on.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 350}
{"text": "Quick question: I just noticed my prescription was sent to the wrong pharmacy. How can this be fixed?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 351}
{"text": "The nurse said, \"I'm sorry, but our office can't schedule that appointment until next week due to staff shortages.\"", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 352}
{"text": "Following up on the request from last week, I wanted to cancel my upcoming appointment scheduled for October 26th. Unfortunately, due to an unexpected issue, I won't be able to attend. I'm disappointed about the timing and anxious about the impact this might have on my treatment timeline. I hope to reschedule soon, but I'm confused about the process for rescheduling an elderly patient's appointment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 353}
{"text": "Re: the issue from my last call, I'm sorry to hear that the treatment hasn't been improving your symptoms. I understand you're feeling frustrated, and I want to schedule a follow-up appointment for this week to reassess your treatment plan. Please let me know which date works best for you.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 354}
{"text": "Re: the issue from my last call on October 26, Case #4567  Hi [Patient Name],  I'm reaching out regarding the recent imaging results from your appointment on October 26th. The findings were reviewed by our team, and they’re still a bit unclear. I understand this might cause some confusion, but I wanted to provide an update.  We’ve scheduled a follow-up appointment for November 15th to discuss these results in more detail. In the meantime, if you have any questions or concerns, please don’t hesitate to call us.  Best regards, [Caregiver Name]  Patient Portal", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 355}
{"text": "The receptionist told me that my appointment was rescheduled again to next Tuesday, which is the third time it's been moved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 356}
{"text": "What happened: My child's lab results are still pending two weeks later.  Here are the main points: The doctor said there was a delay due to holidays.  To clarify, I called the lab yesterday but haven't received a call back.  I'm frustrated and angry about the lack of communication.  Anger and frustration are evident as I wait for answers.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 357}
{"text": "I'm messaging for a family member in my care.  I'm calling about a referral that was supposed to be sent, but I haven't received anything yet. It's been a while now, and I'm a bit anxious and disappointed since we're waiting on this for treatment.  They mentioned it would be done last month, but nothing has come through. I'm confused about the timeline and concerned about when this will get resolved.  I'm looking for some clarification on the status and when to expect the referral.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 358}
{"text": "Over the past two weeks, I've been dealing with a lot of confusion after my insurance claim for the hip replacement surgery was denied. I called the insurer on Monday, and they explained that the procedure wasn't covered under my plan. I was already anxious about the unexpected medical bills, and now I'm worried about affording the treatment. I asked for a written explanation, but they only gave me a brief summary that left me even more confused. I'm looking into my options for an appeal, but I'm disappointed that this happened so soon after the surgery was scheduled. The timeline feels rushed, and I'm frustrated that I haven't received a clearer resolution yet.  ", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 359}
{"text": "Following up: The patient is still not seeing improvement with the current treatment. They mentioned feeling frustrated and disappointed. I'd like to clarify the next steps.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 360}
{"text": "One issue: I'm confused why my scheduled appointment was changed to a different date without notice. I'm frustrated and angry because I've been trying to reschedule for weeks and it's causing me to miss my medication refill. I'm disappointed with the lack of communication.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 361}
{"text": "Need clarification: I'm confused about the recent changes to my treatment plan. The new dosage doesn't seem right, and I'm worried it might affect my recovery negatively. Can you explain this in more detail? I'm feeling frustrated because I'm still not clear on what's happening.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 362}
{"text": "The receptionist told me that they're still waiting on the results, and I'm just so disappointed that it's been this long.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 363}
{"text": "The portal record for my visit shows no available appointments, and I'm anxious about how this will affect my care timeline. I'm frustrated that we're unable to schedule sooner, especially given my elderly patient's needs. We need to find an alternative solution quickly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 364}
{"text": "Regarding my previous message about the diabetes management plan, I'm still confused about the new dosage instructions. I called yesterday but didn't get a clear answer. This is frustrating, and I'm disappointed that it's taking so long to resolve. When can we expect a follow-up?  Patient Case #1234", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 365}
{"text": "What happened: Two different doctors gave conflicting advice about my treatment plan. One says it's urgent to start medication, the other recommends waiting. I'm confused about which one to trust. This is causing me a lot of stress and frustration.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 366}
{"text": "The portal now says that my referral for the specialist was sent incorrectly. I checked the portal record for my visit shows the wrong information, and it doesn't reflect the correct details that were supposed to be included. I'm confused about why this happened, especially since I thought everything was processed correctly. It's frustrating to have to deal with this now, and I'm disappointed that the referral isn't accurate. I need to figure out how to correct this quickly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 367}
{"text": "Re: the issue from my last call, I'm writing to let you know that I had to cancel my upcoming appointment scheduled for October 27th due to an unexpected emergency. I apologize for any inconvenience this may have caused and hope we can reschedule at your earliest convenience.   Please let me know if there are any specific dates or times that work better for me to come in. I'm anxious about getting this resolved quickly but understand if there are any limitations on my end.  Thank you for your understanding and assistance.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 368}
{"text": "Quick question: I'm calling regarding my referral to Dr. Smith. I understand they are not accepting new referrals at this time, but I was told this might change soon. Could you clarify when exactly the next intake period begins? I'm really trying to get this scheduled, and I'm feeling quite frustrated waiting for an update. I have a case number 789456 for reference.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 369}
{"text": "I'm feeling a lot worse with my symptoms, and I'm really confused about what's going on. I'm anxious and frustrated that this is happening again.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 370}
{"text": "After the visit, I was given a bill for services that weren't covered by my insurance, which confused me because the appointment was supposed to be preventive care. I called the office on Tuesday to ask about it, but they couldn't provide a clear explanation and kept saying they would follow up, which only made me more frustrated and disappointed. I'm anxious about the payment coming due soon, and I feel angry that they didn't resolve this properly. It's been a week now, and the resolution is still delayed.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 371}
{"text": "I'm writing on behalf of my father regarding some conflicting advice he received from two different specialists. One doctor recommended surgery, while the other suggested monitoring only. This is causing a lot of confusion and anxiety for us as we try to make a decision. I'm feeling quite frustrated and angry that there isn't more clarity provided by the medical teams involved. I'm also disappointed that we're having to navigate this uncertainty on our own without clear guidance.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 372}
{"text": "What happened: Our insurance company recently denied the claim for the prescription medication. They stated that the payment responsibility falls on the patient even though we have been paying for similar prescriptions before. I called the pharmacy customer service line twice last week, and neither representative could clarify the reason for the change. This is confusing and frustrating because we have always handled our prescriptions through this pharmacy without issues.  ", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 373}
{"text": "Summary: The prescription renewal was delayed due to administrative issues. What happened: I called the pharmacy to resolve the issue. Resolution: They processed the renewal quickly. I feel satisfied with the outcome. Anger is not present.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 1}, "id": 374}
{"text": "I'm contacting you for my mother regarding her medication. She's been experiencing some side effects lately, and I'm confused about what's normal. The doctor mentioned it could be the new dosage, but I'm still worried. I'm also a bit angry because the symptoms seem worse than before, and I can't figure out why. I'm calling to get some clarity on this.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 375}
{"text": "The portal record for my visit shows that my recent blood test results haven't been posted yet. I'm calling because I've been checking the portal multiple times over the past two days and they're still missing. I'm getting really frustrated and angry that this is taking so long, especially since I need these results to discuss treatment options. I'm disappointed with the delay, but I'm not giving up on getting an update soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 376}
{"text": "Need clarification: I'm confused about who is responsible for paying for my grandson's medication. I've been calling around and it's frustrating not getting a clear answer. Case number 789456.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 377}
{"text": "One issue: My insurance claim was denied for the medication refill. I'm disappointed and frustrated about the delay in getting this resolved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 378}
{"text": "Hi, this is Sarah calling regarding the conflicting medical opinions on my treatment plan. Last month during our July 12th appointment, Doctor Smith recommended surgery, but another specialist suggested a different approach. I wanted to follow up on what the team thought would be the best option moving forward. I'm trying to understand which recommendation to prioritize for my care.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 1}, "id": 379}
{"text": "Re: the issue from my last call, I'm still waiting for the refill for my son's medication. I called last Friday, August 5th, and was told they would send the update by email. But nothing has been received. I'm really frustrated and concerned about his condition.  I need to know what the delay is all about. This is the second time this has happened, and it's causing me a lot of worry. My case number is 78910.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 380}
{"text": "I'm really concerned about my mom's condition. The nurse said, \"The treatment isn't helping much, and we're waiting for the specialist to adjust the dosage.\"  I've been dealing with this for weeks, and it feels like nothing is working. It's frustrating and worrying.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 381}
{"text": "I'm writing on behalf of my father, and I'm really anxious about his discharge instructions. They're just too vague, and I can't figure out how to manage his medications and follow-up care. I've been trying to contact the hospital several times, but they keep putting me off. It's frustrating not being able to get clear guidance, especially since he's an adult but not very tech-savvy. I'm worried he might not understand everything himself. I need someone to help us schedule that follow-up appointment and clarify what tests he needs to have done. This is so confusing and disappointing that we're still waiting for answers. I'm really concerned about his recovery right now.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 382}
{"text": "Last Thursday, I met with the billing department to discuss my insurance coverage for the upcoming treatment. They assured me that the provider would handle the claims, but now I'm receiving a letter stating I'm responsible for the full cost. This started about a week ago when I called the insurance company directly and they confirmed the coverage details. I'm frustrated because I trusted the hospital's billing team to manage this, and they're not responding to my calls. The dates are conflicting too—my appointment was scheduled for October 15th, but the billing notice came in yesterday. I'm angry that this is happening during my treatment and confused about who exactly is at fault. It feels like the hospital is trying to avoid responsibility, which is disappointing and adds stress to an already difficult situation.  ", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 383}
{"text": "I'm writing on behalf of my father who has been dealing with persistent pain for over a year now. His most recent appointment didn't provide much relief, and he's really struggling. I've been trying to schedule another visit, but the portal keeps crashing when I try to log in, making it impossible to book an appointment online. He's getting increasingly frustrated and disappointed with the lack of progress and the difficulty in getting help. I'm worried about his condition worsening because of this delay, and I'm confused about what steps we should take next. The case manager's contact information was outdated, so I'm left feeling anxious and unsure about how to proceed effectively.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 384}
{"text": "Hi, I'm reaching out for my spouse. I'm really frustrated and disappointed with the medication instructions we received. I've been giving him his meds as instructed, but he's still not feeling better. I'm confused about why the dosage hasn't worked and I'm anxious about his condition. It feels like we're stuck in a loop without clear answers. I'm hoping you can provide some clarity soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 385}
{"text": "The pharmacist mentioned, \"Your treatment plan has been updated to include a new medication starting next week.\"  I'm feeling anxious about how this might affect me, especially since I'm already struggling with side effects from my current meds.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 386}
{"text": "During the call, I was told that my insurance doesn't cover the co-pay for this medication, but I'm confused because I thought the hospital would handle it.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 387}
{"text": "Following up on the request from last week, I'm still unclear about who is responsible for the payment. I called the office on Tuesday, but no one was able to give me a clear answer. This is frustrating, and I'm worried about the timeline for my next refill. I've been trying to sort this out for the past week, but it's causing confusion and anxiety for me. What's the case number for this issue? I need a definitive response soon.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 388}
{"text": "One issue: My symptoms haven't improved with the current treatment. I'm disappointed and concerned about what's next. Can you provide more information on alternatives?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 389}
{"text": "On the patient portal, the status shows that the refill request for my mother's medication was not processed yet, and I'm worried about her managing her chronic condition without the update.  I checked twice, but the portal doesn't reflect any recent changes regarding her prescription timeline or case number 12345.  This delay causes me stress about ensuring she has a steady supply for her elderly needs.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 390}
{"text": "Since my appointment earlier this month, I've been dealing with this insurance approval mess for my new medication. I called the pharmacy on Monday, September 2nd, to get a refill, and they immediately said it was pending insurance. I waited three days, but no update. On Thursday, they called me back and explained that the insurance denied it because of prior authorization requirements I didn't know about. I'm feeling frustrated and disappointed, especially since I'm on a fixed income and this delay is causing me anxiety. I had to fight to get the details, and now I'm worried about how to proceed. They assured me they're working on it, but I'm still confused about the timeline.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 391}
{"text": "Following up on the request from last week, I'm calling because the diagnosis for my mother is still unclear. I was told they would have the results by Friday, but that was two weeks ago. I'm really confused about the timeline and anxious about how this is affecting her treatment. The doctors seem frustrated that the tests didn't clarify things, but they haven't given a new date. I've been disappointed with the lack of progress, and I'm angry that we're still in the dark after so long. Case number 456789.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 392}
{"text": "Quick question: My appointment was supposed to be on the 20th, but it keeps getting rescheduled. I'm confused and anxious about when it will finally happen.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 393}
{"text": "I'm contacting you for my mother regarding her recent lab results. She had her appointment scheduled for June 15th, and I've been trying to follow up on the test outcomes ever since, but I haven't received any communication from the lab or anyone else about when they will be available. I'm becoming increasingly anxious because her treatment plan depends on these results being reviewed promptly. I called the main line yesterday, and they couldn't provide any information or a clear timeline for when we might expect them. This is really confusing, and I'm starting to feel frustrated that we're not getting updates. I know the process can take time, but without any reassurance or specific dates, it's hard to plan ahead for her next steps. I'm worried that delays like this could affect her care, and I'm disappointed that it's taken so long to get this far. I just need to know what's happening with her results so I can help her move forward.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 394}
{"text": "The portal now says my discharge instructions were sent, but I can't find them anywhere. I'm looking for details on my medications, follow-up, and any home care advice. My anxiety is high because I have my first appointment next week, and I still don't have clear instructions. I've checked all sections and even called the office, but nothing helps. This is frustrating and disappointing, especially since I'm a parent with a busy schedule and I need to understand this before I leave the hospital. I'm worried about making mistakes at home without clear guidance.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 395}
{"text": "During the call, I was told that the medication I need isn't available at the pharmacy anymore. They said it's been discontinued and I'll need to find a different option. I'm really anxious about getting it filled on time.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 396}
{"text": "I'm just confused about my dosage. The receptionist told me my prescription was changed, but I don't see it on my portal.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 397}
{"text": "I'm messaging for a family member in my care. They've been trying to reach their doctor's office for weeks now to get a refill for their prescription, but they're always put on hold for ages or told the number they need is wrong. It's frustrating to see them struggle with something that should be simple. I'm disappointed that we're still facing this issue. We've tried different times of day, but nothing seems to work.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 398}
{"text": "On the patient portal, the status shows that my recent lab results are pending due to missing documents. I'm frustrated because I've already sent those documents once, and they're still not processed. Could someone please check if they were received or what I need to do next?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 399}
{"text": "Following up on the request from last week, I'm calling to discuss the multiple rescheduling requests for the appointment scheduled for October 15th. The appointment was initially set for September 10th, then moved to September 24th due to availability, and now it's been pushed back again to October 30th. This is the third time we've had to reschedule, and I'm concerned about how this impacts the patient's treatment timeline. The patient has a case number 456789, and I've been trying to understand the reason behind each delay. I'm anxious about keeping the patient on track with their care plan, and I'm frustrated by the lack of clear communication from the scheduling team. I'd also like to clarify if there's any expected timeline for when this might be resolved. I appreciate any guidance on how to proceed.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 400}
{"text": "What happened: My adult child's symptoms have been worsening despite the last treatment. They seem confused about the next steps. I'm anxious about their condition. Feeling disappointed with the lack of improvement. Not sure if we're on the right track.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 401}
{"text": "Regarding my previous message from June 15th, I'm still confused about the insurance coverage issue for my refill. I called yesterday and was told it should be resolved by today, but I haven't received any updates or a clear explanation. This is frustrating and disappointing, especially since I need this medication urgently.  I'm looking at my case number 789456 in my chart for reference. Could you please provide more clarity on the timeline and why there's been a delay?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 402}
{"text": "The doctor requested repeat testing due to some unclear results.  I'm worried this might indicate a worsening condition, but I'm not sure what exactly needs repeating.  It's causing me stress to think about the delay in getting clarity.  I feel frustrated that we're going through this again.  There's a lot of confusion about why the tests aren't conclusive the first time.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 403}
{"text": "During the call, I was told that my mom's symptoms have been worsening over the past week.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 404}
{"text": "The receptionist told me that they're missing some documents from my son's file in the portal, and they need those to process his referral for specialist care.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 405}
{"text": "Last Thursday, I was anxiously waiting for the lab results after my routine check-up. The doctor mentioned they would be ready by the following Monday, which seemed reasonable. However, when I called the clinic on Wednesday to follow up, they informed me the results were still pending. I was already feeling frustrated, especially since the delay meant I couldn't schedule my next appointment until I had the results. On Friday, I received an email stating the lab work would be completed by the end of the week, but that was still three days away. I’m disappointed by how little progress is being made and concerned about my health timeline. This delay is causing me significant anger, as it disrupts my planned care schedule.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 406}
{"text": "Last Thursday, I logged into my patient portal to refill my prescription and noticed a message about missing documents for my recent lab results. Confusion set in because I thought I had uploaded everything after my appointment two weeks ago. I called the office on Monday to ask about it, and they informed me that the documents were still pending, which made me angry since my primary care provider has been pushing for timely reviews. I'm disappointed that this issue wasn't resolved during the call, and I'm anxious about when I'll finally get clarity on my health records.  Timeline:  - Appointment on April 10th, 2024  - Portal message on April 17th  - Call to office on April 22nd", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 407}
{"text": "During the call, I was told that my referral for the specialist has been completed and the report is now ready for review. I'm really satisfied with how things are progressing.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 408}
{"text": "I'm calling about a prescription that was sent to the wrong pharmacy for my niece. I received the call yesterday confirming it was sent, but I just called the pharmacy and they said they never got it. This is the second time this has happened, and I'm really frustrated. I'm worried about her condition because of the delay, and I don't know what to do.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 409}
{"text": "I checked the portal this morning and noticed that the patient's symptoms have not improved despite following the prescribed treatment plan. This is concerning, and I'm confused about what might be causing the lack of progress. The patient seems disappointed with the current situation, and they're feeling frustrated that things aren't getting better. I'm here to help figure this out together.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 410}
{"text": "I checked the portal this morning and saw that my appointment for next Tuesday is still pending. The wait time to schedule seems unusually long, and I'm confused about why it's taking so long. I'm disappointed with the delays.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 411}
{"text": "The portal now says there is an unexpected billing charge of $50 for a service not listed on my recent visit summary.  I'm confused because I didn't authorize this charge, and it doesn't match any procedure from my appointment on Friday.  I checked my account details, but there's no explanation provided. This is frustrating and makes me anxious about potential errors in my billing.  Could you please clarify what this charge is for and why it wasn't included in my portal update? I'm disappointed this issue wasn't caught earlier.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 412}
{"text": "Last Thursday, I had my annual check-up and was told my treatment was successful. But since then, I've been left in the dark with no clear guidance on post-treatment steps. This started about a week ago when I called the office, but the nurse couldn't provide a timeline or what to expect next. I'm worried about managing my health without a plan, and I keep checking my portal hoping for updates, but nothing has appeared. It's frustrating to feel like my questions aren't being answered, and I'm anxious about potential complications down the line. I'm disappointed that there's no clear resolution yet, and I don't feel satisfied with the lack of communication.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 413}
{"text": "During the call, I was told that my mother's refill request for her persistent pain medication was delayed due to a new insurance approval process. I'm really confused about why this is happening now, especially since she's been on this medication for a while and it's crucial for her elderly condition. The wait feels much longer than usual, and I'm anxious about her comfort and well-being.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 414}
{"text": "One issue: The discharge instructions were unclear. I'm confused about when to take this medication and when to switch to the other one. I need clarification.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 415}
{"text": "What happened: I'm calling because I received a notice for repeat testing, but I just had my check-up last month.  Here are the main points: The request seems to be a mistake, as my last visit was on [Date] for [Condition].  Summary: I'm confused about why this is needed now and would like clarification.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 416}
{"text": "On the patient portal, the status shows that my payment responsibility is unclear, which is causing me confusion and anxiety. I'm unsure about the billing details and when this will be resolved. I need clarification as soon as possible.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 417}
{"text": "In my portal messages, I can see that my lab results are still pending. I'm starting to get anxious because it's been over a week now, and I wanted to know when I can expect them. The doctor mentioned they would be available by the end of the month, but I'm not sure if that's accurate or if there's been a delay. I checked the portal this morning and it still doesn't show anything, which is confusing. I called the office yesterday, but they couldn't provide an update either. I'm worried about waiting so long without any clear timeline.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 418}
{"text": "One issue: Still waiting on the biopsy results. It's been over two weeks now, and I'm really confused about the timeline. They kept me in the loop with the portal updates, but I'm feeling disappointed and a bit angry that it's taking so long.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 419}
{"text": "To clarify, I received two different answers about my appointment from two staff members.  First, they said it was confirmed for next Tuesday.  Then, the other person told me it was canceled and needs to be rescheduled.  I'm confused about which one is correct.  This is causing me a lot of anxiety about my care.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 420}
{"text": "After the visit, I was disappointed to receive a scheduling error message when trying to book my follow-up appointment. I had scheduled my visit for last Thursday, August 1st, and everything went smoothly. Now, I'm calling the office to schedule my referral for a specialist, but they're closed for lunch. I'm confused about the timeline because I thought the referral would be processed immediately. It's frustrating that I can't get this resolved today, and I'm worried about missing the deadline for the referral. I'll have to wait until tomorrow morning to get this issue resolved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 421}
{"text": "One issue: My insurance claim was denied. I'm checking on what needs to be done.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 422}
{"text": "At the front desk they told me that my test results will be ready by Friday, and I can call back then to discuss them. I'm really anxious about waiting so long.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 423}
{"text": "At the front desk they told me that my prescription for the steroid refill was already sent, but I'm still waiting and I'm really anxious about the flare-up coming back.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 424}
{"text": "Following up on the request from last week, I wanted to mention that I'm still waiting on the results for my unclear diagnosis. I called the office two weeks ago on October 15th, and they said they would follow up with the specialist by now. I'm becoming increasingly frustrated and angry because this is taking too long, especially since I'm an elderly patient and this condition is causing me significant pain and uncertainty. I've been given vague timelines before, and they never stick to them. I'm confused why there's no update yet, and frankly, I'm disappointed in the lack of progress. I need a clearer timeline or else I'll have to escalate this.  I also noticed in my chart that referral #CLIN-2023-5567 was placed on file last month, but I haven't heard from the specialist. Could you please provide an update on when I can expect this to move forward? I feel like my concerns are being overlooked, and I'm anxious about how this is affecting my health and daily life.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 425}
{"text": "The pharmacist mentioned, \"I sent the referral to the correct specialist, but it seems it went to the wrong department.\"  I'm really confused about this. I thought they checked everything before sending it.  This is frustrating, and I'm worried about the timeline for his treatment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 426}
{"text": "To clarify, I'm confused about the recent changes to my treatment plan. The new dosage schedule seems inconsistent with my previous instructions. I'm frustrated because this confusion has caused me to worry unnecessarily about managing my condition. I need more explanation to understand how this adjustment will affect my overall health timeline. ", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 427}
{"text": "The nurse said, \"I know it's been delayed, but there's nothing we can do until the specialist office sends their approval back.\"  I've been waiting forever, and it feels like they're dragging their feet. I need this for my recovery.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 428}
{"text": "Over the past two weeks, I've been dealing with a frustrating situation regarding a referral that was sent incorrectly. Last Thursday, I submitted a referral request for a specialist consultation, and I was informed that it had been sent. However, when I received the confirmation email, I noticed that the wrong specialist was listed. I immediately contacted the administrative team to correct it, but they informed me that the error had already been addressed and the referral was sent as is. I was confused by this, especially since I had double-checked the details before submitting. This morning, I received the bill for the incorrect referral, which has caused me considerable frustration and disappointment. I'm anxious about how this will affect the patient's care timeline and worried that there might be further delays. I'm still trying to get clarification on when the correct referral will be processed, but so far, it feels like the resolution is delayed.  To summarize, I submitted the referral on Thursday, the administrative team confirmed it was sent with an error, and now we're facing a billing issue this week. I'm disappointed that the error wasn't caught earlier and frustrated by the lack of clear resolution.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 429}
{"text": "During the call, I was told, \"The insurance coverage for the refill is unclear, and they're waiting for clarification from another department.\"  I'm anxious because conflicting information keeps coming up, and it's affecting my ability to manage her medications on time.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 430}
{"text": "During the call, I was told that the appointment was rescheduled to a date that conflicts with my work schedule, so I'm trying to find another time that works.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 431}
{"text": "One issue: I'm confused about the referral approval delay for the elderly patient. The pharmacy refill is pending this.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 432}
{"text": "Quick question: I'm still unclear about who is responsible for paying for my son's medication. I've been trying to figure this out but it's frustrating and I'm confused about the timeline.  Could someone clarify this soon?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 433}
{"text": "Following up on the referral request from last Tuesday, I'm still waiting for approval. It's been over a week now, and I'm confused about the timeline. I'm anxious because this affects my treatment schedule. I called the office on Friday, but haven't received any updates. I'm disappointed with the delay. Could you clarify the expected date? Case #4582.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 434}
{"text": "Over the past two weeks, I've been dealing with a serious issue regarding my insurance coverage for my prescribed medications. After the visit earlier this month, I submitted the required forms for prior authorization, but I haven't received any updates or approval. I'm calling today because I'm running out of my medication this week, and without coverage, I can't refill it. I've tried calling the insurance company multiple times this week, but I always get put on hold for at least 15 minutes and then transferred to a different representative each time. I'm anxious about my health deteriorating and also confused about why the process takes so long. I feel frustrated that I'm being kept in the dark, and I'm disappointed that the system isn't working efficiently for me. I need to resolve this quickly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 435}
{"text": "Details: I've been trying to access the patient portal for the past two hours, but I keep getting an error message that my login credentials are incorrect. I've double-checked the username and password, and they seem to be correct based on my last update from the office. I'm not sure if there was a recent system update that might have changed the login process, or if there's an issue with my account. This is frustrating because I need to refill a prescription today and access my lab results.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 436}
{"text": "Regarding my previous message about the appointment change on August 15th, I'm still unable to reach the doctor's office to confirm the new date. I'm confused about why there's a delay and anxious because I need to schedule this as soon as possible. My case number is 789456.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 437}
{"text": "One issue: prescription sent to wrong pharmacy. My elderly parent is having trouble getting it filled. Need clarification on how to proceed.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 438}
{"text": "I'm writing on behalf of my father, who is 82 years old and has been with this pharmacy for a long time. I'm confused because his prescription renewal has been delayed for the second time this month, and he's already running out of his medication. I've tried calling the pharmacy several times, but I keep getting voicemails or being transferred without resolution. This is frustrating because his condition is stable, but he needs his meds consistently to manage his pain. I'm worried about his well-being and the impact this delay will have on his health. I'm confused about what changed or if there's a system error causing this ongoing issue. I've looked at the portal, but the case number isn't clear, and I'm disappointed that this administrative hurdle is affecting my father's care.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 439}
{"text": "This started about a week ago when I received conflicting reports from two different specialists regarding my father's treatment plan. He's an elderly patient, and we're dealing with a complex case involving heart and kidney issues. On Monday, Dr. Smith from Cardiology recommended starting him on a new medication, saying it would address his heart failure symptoms quickly. But yesterday, Dr. Jones from Nephrology called and expressed concerns, suggesting that the medication might worsen his kidney function. I was so confused trying to piece together what was best for him. I called the hospital yesterday afternoon to get clarification and asked if we could schedule a joint consultation. They assured me they'd arrange it for this Friday. I'm really frustrated because I want the best outcome for my father, and this uncertainty is causing me anxiety. However, I'm satisfied that we're finally getting a coordinated approach to resolve this issue once and for all.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 1}, "id": 440}
{"text": "The receptionist told me there's an unexpected charge on my bill for a refill I never authorized.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 441}
{"text": "I'm messaging for a family member in my care regarding their recent imaging results. The doctor called and mentioned some unclear findings, and I'm really confused about what this means. I've been trying to understand the situation, but everything is so vague, and it's causing a lot of anxiety. I'm worried about my relative's health, and the lack of clear information is frustrating. I need some clarification on the next steps.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 442}
{"text": "This started about a week ago when I received notice that my insurance claim was denied. I had just scheduled my appointment for last Tuesday, and everything seemed fine until now. I'm disappointed because I was counting on this visit to cover my ongoing treatment needs. I'm not sure what went wrong or how to fix it. I've been trying to get clarification all week, but I'm still confused and anxious about how this affects my care.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 443}
{"text": "Hi, I wanted to follow up on the instructions I received last Tuesday about the new medication. I'm still confused about when to take the second dose, and it's causing me frustration because I keep messing it up. Could you clarify the timing? My case number is 789.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 444}
{"text": "I'm messaging for my father who has no available appointments. I've been trying to schedule his follow-up for weeks and keep getting redirected. It's causing anxiety about his treatment timeline and filling me with frustration. We've been waiting since last month, and I'm disappointed this issue persists. My father relies on consistent care, and this lack of availability is causing confusion about his upcoming visits.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 445}
{"text": "Over the past two weeks, I've been dealing with conflicting advice from two different specialists regarding my persistent knee pain. Since my appointment earlier this month with Dr. Evans, he recommended surgery, but yesterday at the orthopedic clinic, the doctor suggested conservative treatment with physical therapy. I'm frustrated because I don't know which path to take, and my knee is worsening daily. I called my primary care physician yesterday to get a second opinion, and she echoed Dr. Evans' concerns about surgery, but mentioned the physical therapy could take up to six months. I'm confused about the timeline and the varying recommendations, and I feel anxious about making the wrong decision that could impact my mobility for years. I've scheduled another appointment for next week with both doctors to try to reconcile the differences, but I'm still disappointed that I can't seem to get a clear answer.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 446}
{"text": "I'm contacting you on behalf of my father regarding a referral issue. He received the wrong specialist referral last week, and I'm confused about why this happened. I've tried to figure out the details but the timeline isn't clear. It's frustrating that there's been a mix-up with his care, and I'm worried it might cause delays. Could you please clarify what went wrong and when we can expect the correct referral? I'm also confused about the case number involved and would appreciate any guidance. This situation is causing me anxiety as it affects his treatment timeline.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 447}
{"text": "Following up on the request from last week, I'm still unable to reach my doctor despite multiple attempts. I called yesterday and left a message, but haven't received a callback yet. This is frustrating and disappointing, especially since I need this addressed urgently. I'm worried about my condition worsening without proper guidance.  I'm trying to understand what I'm doing wrong, but the lack of communication is causing confusion. I've been trying to follow up for weeks now, and it feels like my concerns aren't being taken seriously.  I need to get this resolved quickly. Is there a specific case number or timeline I should expect? I'm anxious about the delay and would appreciate any clarification on when I can expect a response.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 1, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 448}
{"text": "Dear [Recipient Name],  I am writing to follow up on the referral that was sent incorrectly for my mother. Last week, I contacted your office about the referral for her specialist appointment, but it seems the information was not processed correctly. I'm referring to the call we had on [Date, e.g., October 26th]. I'm concerned because this delay might affect her treatment timeline. I've attached the correct documents for your reference, including her case number [Case Number, e.g., 12345].  I'm feeling quite frustrated and disappointed with this situation, as my mother relies on these referrals for her care. Could you please look into this urgently and let me know what steps you're taking to resolve it? I appreciate your prompt attention to this matter.  Thank you for your help.  Sincerely,  [Parent's Name]  ---  Attachment: Correct referral documents", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 449}
{"text": "What happened:  Patient reported increased shortness of breath despite medication adjustments this week.  Follow-up appointment scheduled for October 25th at 2 PM.  Unable to refill prescription due to insurance claim rejection.   ", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 450}
{"text": "I just checked the patient portal, and I'm still waiting for my mom's delayed lab results. I'm really anxious about the timeline, and it's frustrating that they're not available yet. She's elderly and has a lot of follow-up needed, so I'm worried about the delays.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 451}
{"text": "Summary: I'm still waiting for test results and haven't been given a clear timeline. What happened: The doctor mentioned it might be something rare, but didn't specify what. To clarify, I asked for a follow-up appointment but they couldn't schedule one yet. I'm frustrated because this uncertainty is affecting my daily life. I need someone to give me straight answers soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 452}
{"text": "Re: the issue from my last call, I'm still waiting for my post-treatment guidance. It's been over a month since my last appointment, and I've been trying to manage my recovery without clear instructions. I'm really disappointed that this hasn't been addressed yet. I called the office last Tuesday, but no one was able to provide an update. I need some clarity on what steps I should take next.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 453}
{"text": "The portal now says my persistent pain referral is still pending. I'm confused because I thought I submitted it weeks ago. Can someone please check the status?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 454}
{"text": "Following up on the request from last week, I wanted to touch base regarding the unclear diagnosis. I've been trying to get more clarity on the test results, but it's proving difficult. I'm really confused about the timeline for next steps and frustrated that we're still waiting. The case number is 12345, and I’d appreciate an update soon.  Could you please provide more details on the next steps? I’m anxious about the delay and would like to understand the reasoning behind the current status.  Thank you.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 455}
{"text": "Details:  We are adjusting the treatment plan to include weekly sessions starting October 15th.  The new plan includes adding medication B due to concerns with the current effectiveness.  We understand this change may require additional coordination on your part.  Please contact the office by Friday to discuss scheduling.  To clarify,", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 456}
{"text": "Need clarification: I've been trying to reach Dr. Smith for a week now about my son's test results, and I'm getting increasingly anxious. We've missed important follow-ups before, and this feels like another delay. I'm disappointed but need to know what's holding things up.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 457}
{"text": "The portal record for my visit shows that the patient was discharged without any clear instructions on post-treatment care. I'm worried about managing their recovery at home. They haven't received any refill information for their medications either. The portal doesn't have any guidance on when to return for a follow-up. This leaves me anxious about potential complications and unsure about what steps to take next. I've been trying to contact the clinic for clarification but haven't gotten a response yet.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 458}
{"text": "The nurse said, \"Could you repeat the dosage instructions for the new medication? I'm still a bit unclear on when to take it.\"", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 459}
{"text": "Since my appointment earlier this month, I've been feeling increasingly frustrated with my treatment for my chronic back pain. I started the new medication regimen two weeks ago, but my symptoms haven't improved at all. In fact, they've worsened slightly, especially with the constant dull ache that's now radiating into my legs. I'm disappointed that the specialist's plan hasn't worked, and I'm left feeling confused about what's next. I'm anxious to find relief, but the delay in seeing another specialist for a second opinion is adding to my frustration. I called the clinic last week to schedule a follow-up, but they said it would be at least two weeks. This timeline is concerning, and I'm worried that my condition might be getting worse without a clear solution.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 460}
{"text": "After the visit, I was given detailed instructions on my new medication regimen, but I'm still confused about when to take the second pill. I called the clinic twice this week to clarify, and each time the information seemed different. Today, I called again, and the nurse confirmed that I should take it with food, but I'm frustrated because I feel like I'm not getting consistent answers. I'm worried I might be taking too much or not enough, and that's causing me anxiety. The doctor's office didn't provide a clear timeline for when I should expect to feel better, which only adds to my confusion.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 461}
{"text": "The portal record for my visit shows that the referral approval is still pending after two weeks, which is causing delays in getting the medication refilled. I'm really frustrated and angry about this ongoing delay, especially since my elderly mother's condition requires timely treatment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 462}
{"text": "I checked the portal this morning and noticed that there's no recent update regarding my appointment with Dr. Smith. I'm trying to understand how to reach him directly since I need to discuss a follow-up issue. It seems like the portal doesn't have a way to contact him this time. I'm feeling frustrated because I've been waiting for a while and still haven't received a call back. Hopefully, they'll update the portal soon.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 463}
{"text": "What happened: I received my recent billing statement and noticed an unexpected charge for a service I did not receive. This is confusing because I was told all services would be confirmed before billing. Could you please review the charges and let me know which service this refers to? I'm worried about the accuracy of my bill.  I called last week about my concern but haven't received a follow-up or resolution yet.  I'm confused and anxious about the discrepancy.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 464}
{"text": "During the call, I was told that the imaging results were unclear, and we might need another test. I'm not sure what that means for my dad's treatment.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 465}
{"text": "I'm reaching out for my spouse. They had been feeling much better after the treatment, but now their symptoms are returning, and I'm worried about what this means. I called the clinic yesterday, but they couldn't give me a clear answer on what to do next. They mentioned it might be too soon for the medication to kick in, but I'm confused about the timeline. My spouse is having trouble sleeping and seems really frustrated with how things are progressing. I'm feeling anxious myself, not sure if we're on the right track or if I should be seeking another opinion. It feels like we're stuck in this loop without any resolution, and honestly, it's a bit angering that we can't seem to get a straight answer.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 466}
{"text": "What happened:  The new treatment plan adjustment was sent to the pharmacy, but there was confusion about the dosage change.  I'm feeling anxious about the timing of this change and worried it might cause side effects.  Anger and disappointment are rising because the instructions weren't clear enough for the pharmacy to process without errors.  Please let me know when this is resolved.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 467}
{"text": "I checked the portal this morning and noticed my recent visit still shows unresolved symptoms. The portal record for my visit shows the doctor flagged this issue but hasn't provided details. I'm anxious and angry about the lack of communication.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 468}
{"text": "Following up: I'm writing to ask about the delay in my referral approval. It's been over a week and I'm starting to worry about getting timely care. Any update would be appreciated.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 469}
{"text": "They told me that my referral for the medication is still pending approval, and they couldn't provide an estimated timeline.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 470}
{"text": "I'm reaching out for my spouse, who is 32 years old and relies on his prescription medication. I've been trying to get this renewed for weeks now, and I'm getting increasingly frustrated and angry. The pharmacy called in saying it was delayed, but I'm confused because I thought this particular prescription was supposed to be automatically renewed. I'm anxious about how this will affect his condition, and frankly, I'm disappointed with the process. Can someone please help me understand what's going on and when this might be resolved?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 471}
{"text": "Last Thursday, I received conflicting advice from two specialists regarding my father's treatment plan. One recommended continuing the current medication, while the other suggested a complete change. This has caused significant confusion and frustration, especially since my father is elderly and the timeline for decisions is tight. We're still waiting for a third opinion to resolve this unresolved issue.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 472}
{"text": "One issue: I'm having trouble reaching my doctor. I've tried calling for two days and keep getting voicemail. It's causing a lot of anxiety, and I'm worried about my condition. I'm disappointed they aren't returning calls promptly.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 473}
{"text": "Since my appointment earlier this month, I've been trying to access the patient portal to refill my medication, but it's been a real hassle. I first noticed the issue about a week ago when I logged in one morning and the system wouldn't recognize my password. I reset it a few times, thinking it was a simple glitch, but then I got an error message saying my account was temporarily locked. I called the support line yesterday, and they guided me through resetting it again, but it happened once more this morning. I'm feeling frustrated and confused because I know I didn't try to log in multiple times. I'm anxious about missing my refill deadline, but I'm disappointed that the system keeps malfunctioning. Fortunately, after speaking with a supervisor, we resolved it, and I can now access the portal without issues.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 474}
{"text": "The portal now says the test results are still pending. I'm anxious and frustrated because my mother needs this information to continue her treatment. It's been over a week, and I'm disappointed with the delay. I called the clinic, but they couldn't provide a timeline.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 475}
{"text": "Following up: I received the letter denying the insurance claim. They said it's because the service wasn't covered under the plan. I'm really frustrated and angry about this. I don't understand why it wasn't approved since it's medically necessary for my patient's condition. I need to figure out how to get this resolved.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 476}
{"text": "Details: Our patient's insurance coverage for the recent treatment has been denied. We submitted the claim on August 15th and received notification on September 5th. The reason provided by the insurer is unclear at this time. We are escalating this issue to their reconsideration department. Patient is satisfied with our prompt resolution efforts.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 1}, "id": 477}
{"text": "I'm reaching out for my spouse. The prescription for his blood pressure medication was sent to the wrong pharmacy yesterday, and they're still waiting on it. I'm really disappointed and frustrated because we're already behind on his refills, and it's causing a delay in his treatment. I need to figure out how to get this resolved quickly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 478}
{"text": "About the referral noted in my chart from June 15th, I'm reaching out because I've been trying to schedule an appointment with Dr. Smith, but I keep getting referred elsewhere. This is frustrating and causing delays in my treatment plan. I'm looking for an update on when they will accept this referral or if we need to find another specialist.  Additionally, I noticed my case number is still listed as 789ABC in the portal, and it feels like my concerns aren't being addressed promptly. I'm anxious about the ongoing wait and confused about the timeline for resolution.  I understand administrative processes can be complex, but I'm hoping for a clearer explanation soon. I'm disappointed that this referral isn't being processed as expected, and I need to ensure I'm not overlooking any steps.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 479}
{"text": "This started about a week ago when I received my discharge instructions from the hospital after my surgery. The doctor provided a brief overview of my procedure, but there was no detailed guidance on post-operative care or follow-up steps. Since my appointment earlier this month, I’ve been trying to piece together what I need to do. I called the clinic twice to ask about wound care and when to schedule my next appointment, but both times, I was given vague answers. For example, on the first call, I was told to 'follow up with my primary care provider,' but no specific date was provided. Then, last Friday, I finally got a call saying my follow-up is scheduled for three weeks from now, but I’m still confused about when to start physical therapy, which wasn’t discussed during my initial surgery consult. I’m worried I might be doing something wrong at home, like not changing my bandage properly or not recognizing signs of infection. My confusion is making me anxious about my recovery timeline, and I feel disappointed that the clinic didn’t provide clearer instructions upfront.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 480}
{"text": "The portal record for my visit shows that the required documents are still missing. I have been trying to complete this for weeks now, and it's causing significant delays in my treatment. I'm really frustrated and disappointed that this issue isn't resolved yet. My case number is 789456.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 481}
{"text": "In reference to the appointment change scheduled for October 15th, I'm really anxious about the delay in getting it rescheduled. I called yesterday and still haven't received any updates. This is frustrating, and I'm feeling quite disappointed with the lack of progress on my case number 78945.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 482}
{"text": "Last Thursday, I called the pharmacy to refill my father's prescription for his hypertension medication, which he takes daily. The pharmacist informed me that the specific brand was unavailable due to a supply chain issue and offered a generic alternative. I agreed, but when I arrived today, the generic option wasn't in stock either. My father, who is in his late 80s, relies on this medication strictly, and without it, his condition has worsened slightly. I'm anxious about his health and disappointed that there's no resolution yet. I called again this morning, and they said they're still waiting on a shipment, so I'm hoping it arrives soon. Otherwise, we may need to consult his doctor again, which feels frustrating and confusing about the timeline.  He's been having more frequent headaches since last week, and I'm worried it's related. The pharmacy mentioned it could be a few more days, but I'm not sure how long they've been waiting or if this is the first time. I'm trying to manage his symptoms with over-the-counter options, but it's not ideal. I just want a clear plan and some certainty about when things will stabilize.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 483}
{"text": "During the call, I was told that there are no available appointments for at least the next two weeks due to scheduling issues.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 484}
{"text": "My symptoms haven't improved much with the new treatment. I'm feeling frustrated because I'm still in pain. I'm confused about what's expected from me next. I'm anxious about when things will get better. I need more clarification on the plan.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 485}
{"text": "Regarding my previous message, I'm still experiencing significant pain despite the treatment plan we discussed. I was scheduled for an appointment on August 15th, but I'm concerned about how the persistent symptoms might be affecting my daily activities. I'm worried this ongoing issue might be more complex than initially thought, especially since I've been feeling frustrated with the lack of clear answers. Case #4567.  I'm hoping for some clarification on the next steps, as I'm feeling quite disappointed that my concerns haven't been fully addressed yet. This uncertainty is causing me a lot of anxiety.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 486}
{"text": "The portal now says my lab results are still pending. I checked this morning and they were due last week. I'm confused why they're delayed and frustrated by the lack of communication. This is really upsetting.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 487}
{"text": "Following up: I'm having trouble accessing the patient portal today. I've tried logging in multiple times, but it keeps redirecting me to the login page without success. I'm a bit frustrated and anxious about getting this resolved, as I need to check my test results. Can you please look into this?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 488}
{"text": "Following up on the request from last week, I'm still waiting for the missing documents to be uploaded to my portal. The deadline was clearly marked as August 15th, but I haven't received any update. I'm confused about why there's a delay, especially since I've checked three times and they're still not there. This is causing some anxiety as I need them for my upcoming appointment. Could you please provide an update on when they might be available?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 489}
{"text": "I'm reaching out for my spouse. I'm confused about who is responsible for paying for his recent treatment. The bills keep coming, but we're not sure if it's covered by insurance or if I need to handle it. This is frustrating and disappointing because we're trying to get things straight, but the timeline is unclear. We need clarification on the due dates and case number for the next steps.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 490}
{"text": "Summary: The patient's appointment was rescheduled multiple times due to scheduling conflicts. Details: The initial date was postponed twice, and the final date was set for [date]. What happened: The delays caused anxiety for the patient regarding the timeline. Referral updates were delayed as a result.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 491}
{"text": "Last Thursday, I received my monthly statement and noticed a charge for a service I didn't use. I called the office, and they confirmed it was a billing error. This started about a week ago when I first saw the charge, and I'm still waiting for them to correct it. I'm confused why it was charged and frustrated that it's taking so long to resolve.   I've been trying to understand the timeline, but there's no clear update since last Monday's call. I'm disappointed that my case isn't moving forward faster, and I feel anxious about when I'll finally get this sorted.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 1, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 492}
{"text": "Hi, I'm calling about the referral noted in my chart for further testing. I wanted to follow up because I'm still experiencing some of the symptoms I had before treatment started, despite completing the course. It was around mid-April when we discussed this, and I've been trying to manage it but I'm feeling quite anxious about it. I just wanted to make sure everything is on track with the referral and what the timeline looks like for the next steps.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 493}
{"text": "Summary:  I have been waiting for a response regarding my medication refill request submitted on August 15th. There is no update in the portal, and I have not received any communication from the office.  I'm concerned because this is my first time needing a refill and I'm anxious about running out of medication.  The previous prescription was for a three-month supply, but I started taking it in mid-July, so I need this refill soon.  I am frustrated that there's no timeline provided for when I might expect a reply.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 494}
{"text": "Re: the issue from my last call on October 28th, I'm still facing issues with my insurance coverage for the medication refill. I called yesterday and was told it was being looked into, but as of today, nothing has been resolved. This is frustrating and causing a delay in my treatment.  I'm confused why this isn't being handled faster, especially with my case number 123456. I expected this to be resolved by now, and it's causing me significant anxiety about managing my condition.  I need a resolution soon.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 495}
{"text": "I'm messaging for a family member in my care regarding their scheduled follow-up appointment. The appointment was supposed to be this past Tuesday, but it was delayed due to an unexpected issue with the billing. I'm satisfied that the team is working on it, but I'm a bit frustrated that the delay caused some confusion about the timeline. I've been tracking everything, and they've assured me it's resolved now, which is good to hear.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 1}, "id": 496}
{"text": "We received your call regarding the billing discrepancy.  I'm very concerned about the charges on my insurance statement that don't match the services provided.  They are billing for a procedure I never received, which is causing anxiety and frustration.  I need this resolved quickly because I'm worried about the financial impact and delays are adding to my disappointment.  Please let me know the exact steps being taken to correct this.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 1, "satisfaction": 0}, "id": 497}
{"text": "I'm following up for my brother who has been dealing with conflicting medical opinions lately. His primary care doctor recommended surgery, but a specialist at another hospital suggested a different approach entirely. I've been researching both options and I'm really anxious about making the right decision for him. The conflicting advice is causing a lot of confusion, and I'm feeling frustrated that we can't seem to get a clear answer. I've scheduled two separate follow-up appointments just to compare notes, but it's been discouraging to see how long this is taking. I'm worried about the timeline and the potential impact on his treatment plan, and I'm hoping for some resolution soon.  I'm reaching out to the patient portal to share some of the information I've gathered and see if there's any guidance available. I've attached the summary of both doctors' recommendations, along with some resources I found helpful in understanding the differences. I'm disappointed that we haven't received any input from the hospital yet, but I want to make sure they're aware of the situation. I'm trying to stay positive, but the ongoing uncertainty is really weighing on me. I appreciate any support or advice that can help us navigate this confusing time.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 1, "disappointment": 0, "satisfaction": 0}, "id": 498}
{"text": "Following up: The refill for his chronic condition meds hasn't arrived yet, and we're worried about managing his symptoms without it. Disappointed with the delay.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 1, "confusion": 0, "frustration": 0, "anger": 0, "disappointment": 1, "satisfaction": 0}, "id": 499}
{"text": "Following up: I'm really frustrated with the recent changes to the treatment plan. It's confusing and I don't feel like it's being handled properly. Can we clarify what's happening soon?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0, "confusion": 0, "frustration": 1, "anger": 0, "disappointment": 0, "satisfaction": 0}, "id": 500}
