{"text": "I have been experiencing persistent headaches for over a month now. I tried taking over-the-counter pain relievers, but they haven't helped. When should I consider seeking further medical attention?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.75, "confusion": 0.25, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "d2215aec-2ef2-48e7-9d65-74bc485dba05"}
{"text": "My recent blood test results were not clear. The report mentioned an abnormal value, but it didn't specify which marker and what the normal range is. Can someone clarify this for me?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.6, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "4818b905-7e2f-4a12-9551-c4808563ce5c"}
{"text": "I am scheduled for a follow-up appointment next Tuesday at 3 PM. The office said to bring the updated imaging results, but I haven't received them yet. Should I call to confirm the procedure?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.3, "confusion": 0.4, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "db589611-f0c5-44b5-8adb-5c1f4f93fc35"}
{"text": "I need to request a copy of my medical records from last year. The portal system is confusing, and I couldn't find the correct option to submit the request. What steps should I follow?", "domain": "administrative", "language": "en", "emotions": {"confusion": 0.7, "frustration": 0.3, "anxiety": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "4beb1251-6290-4d06-b468-506af6e53e94"}
{"text": "I was diagnosed with a mild urinary tract infection a week ago, and I've been taking the prescribed antibiotics. The symptoms have improved, but I still have a dull ache in my lower back. Is it possible the infection isn't fully resolved?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.65, "confusion": 0.2, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "6cb638c2-8e43-4d12-b260-451db6b62154"}
{"text": "I called the office yesterday to schedule a follow-up after my recent blood test results. The nurse said they would contact me by Friday to discuss the results and set up an appointment. I haven't received any call yet, so I'm checking now to see if there's an update.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.6, "confusion": 0.4, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "cd2aadbb-69e5-4245-98ac-b8c25970e8ff"}
{"text": "I'm having persistent lower back pain for about three weeks now. It started after I lifted a heavy box at work. I took some over-the-counter pain relievers, but it hasn't helped much. I think I need to see a specialist because the pain is getting worse and it's affecting my ability to walk long distances.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.5, "confusion": 0.3, "frustration": 0.2, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "1eb5910c-8737-4e98-8cbc-a0e19fab8fb3"}
{"text": "I forgot my diabetes medication renewal form at home. I need to get it signed by my doctor before I can refill the prescription. I called the pharmacy earlier today, and they said the refill won't be processed until I have the form. They suggested I contact my doctor's office as soon as possible.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.4, "confusion": 0.5, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "559edc5d-a130-4494-8586-823acdcdb0dd"}
{"text": "I just received my MRI results showing a small abnormality in my lung. The doctor who ordered the test said it might be nothing serious, but they want to schedule a follow-up CT scan in three months to monitor it. I need to make sure I get the full report and understand what the next steps should be.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.3, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "7f7ec632-7561-420e-afe2-1c6782ab9057"}
{"text": "I'm trying to access my medical records through the portal, but I keep getting an error message that my account needs verification. I've tried resetting my password twice, but it keeps redirecting me to the same page. I'm not sure if I need to contact support or if there's something wrong with my login details.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.3, "confusion": 0.6, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "9c35ff37-f20e-4147-9d1a-242038133401"}
{"text": "I called the lab yesterday to check the results for my cholesterol panel but they said it's still pending. My doctor's office called back and they're waiting on the report from the hospital. I need to know when I can expect these results so I can decide if I need to make any changes to my diet.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.75, "confusion": 0.25, "frustration": 0.15, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "e0bd0e58-3580-443c-a15a-504ed39f9e31"}
{"text": "I tried to access my health record through the patient portal three times today but it keeps asking for a different security code than the one I set up. I've forgotten what the old code was and the system won't let me reset it without answering a security question I don't remember. I need help accessing my records.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.2, "confusion": 0.5, "frustration": 0.4, "anger": 0.05, "disappointment": 0.2, "satisfaction": 0.0}, "id": "1f7044e9-8d76-4143-829c-bb2fb77356fa"}
{"text": "I was scheduled for an MRI on Tuesday but I haven't received the confirmation email or text message. I called the scheduler this morning and they said they would send me a reminder but I need to confirm my appointment time before I leave work on Friday. Can you please send me the confirmation immediately?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.3, "confusion": 0.4, "frustration": 0.35, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "cfa2cd50-e8d0-403d-a7b3-1913b0646eb0"}
{"text": "My prescription for blood pressure medication was due to be refilled last week, and I called the pharmacy to check. They said the prior authorization is still pending. I've been monitoring my blood pressure at home and it's been stable, but I want to avoid any gaps in treatment. What is the status of this authorization?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.4, "confusion": 0.2, "frustration": 0.25, "anger": 0.0, "disappointment": 0.15, "satisfaction": 0.0}, "id": "d4b92cb9-4c66-441a-bbdc-c43040f4ac55"}
{"text": "I had a follow-up appointment with my cardiologist last month and they mentioned I might need a cardiac catheterization. I haven't received any further instructions or scheduling information since then. The office called and said they're waiting on the results from my recent stress test. Could you please clarify the next steps in my care plan?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.3, "frustration": 0.2, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "41aeccef-ca90-4af5-9abe-c86beb29285d"}
{"text": "I have an appointment scheduled for tomorrow at 10:30 AM with Dr. Smith. The office called to confirm my visit and mentioned the results from my recent blood work are needed before the appointment. I haven’t received those results yet. What do I need to do to get them sent over?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.65, "confusion": 0.35, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "c43cd10b-ad67-4cb5-9500-884bfccb8cd7"}
{"text": "The prescription I picked up yesterday for my hypertension was supposed to start working within a week. I’ve been monitoring my blood pressure at home, but the readings are still high. I’m due for a follow-up in two weeks, but I wanted to ask if there’s anything else I can do in the meantime.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.2, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "2280dfa5-5669-4ddd-9886-ad3adfb5da00"}
{"text": "I tried to access my lab results through the patient portal yesterday, but I keep getting an error message that my login is invalid. I’ve reset my password twice already without success. Could someone help me figure out how to log in properly?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.4, "confusion": 0.4, "frustration": 0.2, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "570f09be-f977-48d8-a164-d8f93dc31a58"}
{"text": "My MRI results from last month are still pending. The scheduler said it would take about a week, but it’s now been five days and nothing has been mentioned. I called the office two weeks ago and haven’t heard back. How can I check on the status of my results?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.6, "confusion": 0.3, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "a28a2e09-1a74-48b6-8706-579dc4a10d9d"}
{"text": "I received my bill for a recent consultation and noticed a charge for a diagnostic test that I didn’t authorize. The test was ordered by my primary care physician, but I haven’t been billed for it before. Can you clarify what this charge is for and if it was properly approved?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.2, "confusion": 0.6, "frustration": 0.2, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "56dd1889-d891-484a-8740-2b4c1295adde"}
{"text": "I called about my recent blood test results and was told to expect an email from the lab with details. Haven't received it yet, but my appointment is in two weeks so I'll need to review them then. What's the typical turnaround time for these?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.85, "confusion": 0.4, "frustration": 0.15, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "0436fe9e-9ca4-46cd-9d3f-2735a088c69a"}
{"text": "My prescription for the antibiotic ran out two days ago. The last refill was requested on June 10th, but the pharmacy called saying there was an issue with the insurance coverage. Can you check if there are any alternative medications that would be covered under my plan?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.5, "frustration": 0.3, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "78aba43a-a797-4498-a3e3-d9e3628420f5"}
{"text": "I've been having persistent lower back pain for about three weeks now. It started after lifting a heavy box at work yesterday. I took ibuprofen this morning but it didn't help much. Should I come in for an evaluation before the weekend?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.65, "confusion": 0.2, "frustration": 0.05, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "590e11d2-81b6-49b7-a2f2-ba063828fa6e"}
{"text": "My CT scan results for the chronic sinus infection were received yesterday. The report mentions some abnormal findings but doesn't specify what they mean. I need to schedule a follow-up with a specialist to discuss these findings further. Is there a particular type of specialist you recommend?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.75, "confusion": 0.6, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "18e9fbd2-e3d0-4c3a-a8df-9184ec254628"}
{"text": "I received a letter from the hospital billing office regarding my recent surgery. It states there may be an overpayment adjustment needed. I'm unsure about the details and would appreciate clarification on what this means for my account. Can someone help explain this?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.55, "confusion": 0.7, "frustration": 0.25, "anger": 0.0, "disappointment": 0.05, "satisfaction": 0.0}, "id": "b59bea57-e327-4dfe-9651-77c291cae2aa"}
{"text": "My appointment with Dr. Smith was scheduled for 2:00 pm yesterday, but I never received a call to confirm. Should I wait for the reminder or contact the office?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.6, "confusion": 0.4, "frustration": 0.2, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "805860d5-07fa-43c9-a617-28a4e2ce8e49"}
{"text": "I called the lab to get the results for my blood test from last Tuesday. They said it will be ready in two days, but I need to know if there was anything abnormal.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.3, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "b6949e78-2d0a-4274-abce-85c29726a7cc"}
{"text": "I have been experiencing persistent headaches for about three weeks. The last doctor visit didn't reveal any issues, but I still feel concerned about the cause.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.2, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "d6ff26d8-f086-4937-a5c3-bb6cc673a5a3"}
{"text": "My prescription for the new medication was supposed to be refilled automatically, but I received a notice that it needs a new doctor's authorization. How do I proceed with that?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.5, "confusion": 0.5, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "bab22594-34f0-42b2-9577-810143418f95"}
{"text": "I had a CT scan scheduled for Monday due to ongoing chest pain. The results show a mild abnormality, but I need clarification on what this means and if further testing is required.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.9, "confusion": 0.6, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "bfd445fa-e7de-4966-9ace-00d217f4a02b"}
{"text": "I submitted my lab results from last week but haven't received a call about my appointment yet. The website says my test results are pending, but I'm not sure if they're ready. Should I call the office to check on this?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.6, "frustration": 0.4, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "72d48f9d-e447-4ab5-bc8b-2896ab4652eb"}
{"text": "My blood pressure reading during my recent check-up was 150/95, which is high. The doctor mentioned starting me on medication but I need to know what the target goal should be and if there are any immediate steps I can take.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.5, "frustration": 0.3, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "af9d6f6a-f3f1-4af3-a43c-f346c74e341b"}
{"text": "I forgot to bring my insurance card to the appointment today. The office called to confirm and said I need to provide verification before my next visit. What documents are required and how far in advance should I send this?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.6, "confusion": 0.7, "frustration": 0.4, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "597b7acd-b2a1-4d06-ae0e-a659738bfccc"}
{"text": "My MRI results for the lower back pain I've had for months are back. The report mentioned degenerative changes but didn't specify if surgery is needed. I need to understand what the next steps are and if I should consider physical therapy first.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.6, "frustration": 0.3, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "172883ed-bec8-402e-bcd5-09408ee4218f"}
{"text": "I received a letter from my insurance company stating my claim was denied. The explanation says there might be a missing form, but I can't find any gaps in the portal submission. Could you help me figure out what additional information is required?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.65, "confusion": 0.75, "frustration": 0.5, "anger": 0.0, "disappointment": 0.2, "satisfaction": 0.0}, "id": "c9fc2972-4af0-4728-8f15-3f84861eb337"}
{"text": "I had my blood test results ready for review. The doctor mentioned my cholesterol was elevated but didn't specify the exact numbers or what the target should be.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.75, "confusion": 0.45, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "cedb8a70-353b-405c-911e-30e3ae6756eb"}
{"text": "I received my prescription but the label didn't mention the dosage instructions. Could someone clarify how many pills to take each day and for how long?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.6, "confusion": 0.55, "frustration": 0.15, "anger": 0.0, "disappointment": 0.05, "satisfaction": 0.0}, "id": "3f6965cc-d067-4dc0-baf9-d2a33a2321e0"}
{"text": "My appointment was scheduled for next Tuesday at 3 PM, but the confirmation email showed a different time. Who should I contact to resolve this discrepancy?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.3, "confusion": 0.6, "frustration": 0.25, "anger": 0.05, "disappointment": 0.0, "satisfaction": 0.0}, "id": "bef240c5-4486-4760-9070-aa65a5791ca2"}
{"text": "I'm having intermittent chest pain and shortness of breath. I called the clinic yesterday but haven't heard back. What's the typical turnaround time for urgent cases?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.85, "confusion": 0.35, "frustration": 0.2, "anger": 0.0, "disappointment": 0.05, "satisfaction": 0.0}, "id": "19478fbb-1762-4605-b886-d74917392fea"}
{"text": "There's an issue with my insurance claim for the recent physical therapy sessions. The portal shows it's pending but I'm not sure how long that takes. Can someone explain the process?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.4, "confusion": 0.5, "frustration": 0.3, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "70c0947a-4d5e-43d0-8bf7-808e8346a602"}
{"text": "I called the lab yesterday about my blood test results from June 15th, but they said the report is still pending and not ready yet. What's the expected turnaround time for these specific tests?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.9, "confusion": 0.6, "frustration": 0.3, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "7db955b1-4a1d-4467-be4f-4469f40b4dd8"}
{"text": "My appointment for the follow-up with Dr. Evans was scheduled for next Tuesday, but I noticed a different doctor's name on the confirmation email. Can you clarify who is actually seeing me?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.8, "frustration": 0.2, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "953fedbb-5a79-4ad3-8233-0cd6d5cc6842"}
{"text": "I've been experiencing persistent headaches for about three weeks now, and the last CT scan showed no abnormalities. What other tests might be needed to investigate this further?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.85, "confusion": 0.5, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "640c3dea-66a2-4e5d-b014-bc7b8a2e47bd"}
{"text": "My prescription for the hypertension medication was due to be refilled last Friday, but I received a message that the order was declined. Could you explain why this happened and how I can resolve it?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.75, "confusion": 0.7, "frustration": 0.4, "anger": 0.0, "disappointment": 0.2, "satisfaction": 0.0}, "id": "7d74fed2-e94e-433a-b712-1365ccb583e6"}
{"text": "The biopsy results from my recent colonoscopy are back, and they indicate the presence of early-stage polyps. The surgeon recommended a follow-up procedure in three months. Can you confirm the details of the next appointment?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.95, "confusion": 0.55, "frustration": 0.05, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "f5c719e4-79b7-4415-927c-cbba28c06eac"}
{"text": "I called the lab yesterday to check my lipid panel results, but they said it will take until next week. I need to know what the numbers mean because I have to decide on my next steps for managing cholesterol.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.4, "frustration": 0.3, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "4ec46726-1873-414c-9703-6534d55a9061"}
{"text": "I'm scheduled for an MRI on Monday at 9:30 AM, but I haven't received the access code for the portal. The instructions were unclear, and I need to log in to complete the registration form before the appointment.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.5, "frustration": 0.2, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "c431f98f-fdba-48c4-b710-8c3b0cc01ab1"}
{"text": "My blood pressure has been elevated during the past two check-ups, averaging around 140/90. I started taking the prescribed medication, but I still feel lightheaded occasionally. I'm unsure if I need to adjust the dosage or if there's another factor I'm missing.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.65, "confusion": 0.35, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "54adf10b-06ca-4eea-90cc-fa0021785203"}
{"text": "I had a CT scan last week for a persistent cough. The report mentioned some mild inflammation in my lungs, but I'm not sure what that means or if it's related to my smoking history. I need clarification on the findings and their implications.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.75, "confusion": 0.55, "frustration": 0.15, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "efd1b58c-8146-4ab7-9666-bc438edc8ec7"}
{"text": "I was recently diagnosed with type 2 diabetes after my annual check-up. The doctor recommended starting insulin, but I've been hesitant due to concerns about side effects. I need more information on how the treatment might affect my daily routine and long-term health.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.85, "confusion": 0.45, "frustration": 0.05, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "d8bf2004-6645-4ad8-a4ce-3eb188f83c53"}
{"text": "I received my lab results yesterday but I don't understand what the elevated liver enzymes mean. The doctor called briefly but I didn't get all the details. I need to schedule a follow-up to discuss this further.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.75, "confusion": 0.6, "frustration": 0.15, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "d6d73953-6362-4803-a10f-36af598d9d4a"}
{"text": "My insurance claim for the physical therapy session last week hasn't been processed yet. I submitted the receipt and forms on the portal, but there's no update. I need to call the billing department to check the status.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.25, "confusion": 0.4, "frustration": 0.3, "anger": 0.1, "disappointment": 0.0, "satisfaction": 0.0}, "id": "5083c999-28be-4996-b50e-1fe037febeb1"}
{"text": "The prescribed medication for my hypertension started showing side effects after three days. I'm experiencing persistent headaches and dizziness. I should probably talk to the pharmacist about possible alternatives or dosage adjustments.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.6, "confusion": 0.2, "frustration": 0.2, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "604474df-b18e-49a8-b2a3-00ff45ac217d"}
{"text": "I'm having trouble accessing my medical records through the patient portal. When I try to log in, I get an error message about invalid credentials, even though I'm sure my username and password are correct. I need to request a password reset or check the system requirements.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.3, "confusion": 0.5, "frustration": 0.4, "anger": 0.05, "disappointment": 0.0, "satisfaction": 0.0}, "id": "8446e789-6be5-4f54-ac9e-5ac0d5b6309d"}
{"text": "My biopsy results for the suspicious mole removed last month should be available by the end of the month. I'm due for a follow-up appointment in two weeks to review the findings and discuss next steps. I need to prepare questions about potential treatments if needed.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.3, "frustration": 0.05, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "16be08c7-8bf4-49ae-8052-60888279c74c"}
{"text": "I need to reschedule my appointment for the rash consultation because I can't make it on October 22nd. What are my options for finding another time?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.0, "confusion": 0.4, "frustration": 0.3, "anger": 0.0, "disappointment": 0.2, "satisfaction": 0.0}, "id": "e3091173-2fd9-445d-817b-2a969254002d"}
{"text": "The results for my blood test are ready. The doctor said there might be an issue with my kidney function. I need to get the full report and understand what follow-up steps I should take.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.3, "frustration": 0.0, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "c7cf0ced-4917-49d0-85cb-8a4b35179f6d"}
{"text": "I'm having persistent headaches since last week and I haven't taken any pain medication. I called the clinic earlier but didn't get through. How do I get in touch with a nurse?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.4, "confusion": 0.5, "frustration": 0.4, "anger": 0.0, "disappointment": 0.2, "satisfaction": 0.0}, "id": "a714e64b-4e46-4be3-b182-19a26c28d9ee"}
{"text": "My prescription for the antibiotic ran out three days ago, but I haven't received a renewal. The last refill request was processed without issues. Can you check why this time it hasn't been sent?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.0, "confusion": 0.6, "frustration": 0.4, "anger": 0.0, "disappointment": 0.3, "satisfaction": 0.0}, "id": "96e806c6-af25-4b99-bf55-35be3ced3029"}
{"text": "I had my scheduled colonoscopy yesterday and the results indicate the need for a follow-up test. The procedure showed no immediate issues, but I need to know what the next steps are for my care plan.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.2, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "114a7796-22ca-4338-89c9-ff13e9f45a8f"}
{"text": "My appointment for blood work on Friday was canceled. The message said there might be a scheduling error. I need to call the office to confirm if I should reschedule or if another test is required.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.4, "frustration": 0.2, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "4e101bd5-060d-443b-8e8f-7320bfea0eb2"}
{"text": "The results for my recent colonoscopy show mild inflammation in the lower intestine. The doctor wants to monitor it with a follow-up test in three months. I need to schedule that appointment now.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.6, "confusion": 0.3, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "dc4c96e5-a41b-404b-9cf0-e3c11815d59d"}
{"text": "I forgot my login password for the patient portal. I tried resetting it twice, but the system keeps saying the new password doesn't meet requirements. I need to speak with someone from the front desk.", "domain": "administrative", "language": "en", "emotions": {"confusion": 0.5, "frustration": 0.3, "disappointment": 0.1, "anxiety": 0.1, "anger": 0.0, "satisfaction": 0.0}, "id": "9e130d2c-6075-427f-b2ad-3d53c5c57922"}
{"text": "My prescription for hypertension medication was refilled two days ago, but I still have 7 pills remaining. I need to check if there was an error in the refill request or if I miscounted.", "domain": "administrative", "language": "en", "emotions": {"confusion": 0.4, "frustration": 0.2, "disappointment": 0.1, "anxiety": 0.0, "anger": 0.0, "satisfaction": 0.0}, "id": "021c48cb-ccb1-4b0c-9eb3-d8c260d0a275"}
{"text": "I received my MRI results indicating a small abnormality in the left lung. The radiologist recommends a biopsy to determine if it's cancerous. I need to schedule that procedure and discuss the next steps with my doctor.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.9, "confusion": 0.3, "frustration": 0.1, "disappointment": 0.0, "anger": 0.0, "satisfaction": 0.0}, "id": "5f08dd96-075f-498b-b495-52d80e98d6aa"}
{"text": "My appointment is scheduled for Thursday at 2 pm, but I received conflicting information about the location. One source said it's in room 3B, while another indicated the main clinic entrance. I need clarification before arriving.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.95, "confusion": 0.75, "frustration": 0.2, "anger": 0.1, "disappointment": 0.15, "satisfaction": 0.0}, "id": "a16dad2d-e237-46bc-9e5c-14d0c231e73d"}
{"text": "I called the lab yesterday to check the status of my blood test results from last Friday. The automated system said they would call me back by Tuesday, but I haven't heard anything yet. I need to follow up.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.85, "confusion": 0.6, "frustration": 0.3, "anger": 0.1, "disappointment": 0.2, "satisfaction": 0.0}, "id": "71df166c-83f4-4161-a74c-2b51bb757705"}
{"text": "I'm scheduled for a follow-up appointment on October 22nd regarding my hypertension management. The doctor mentioned adjusting my medication, but I didn't receive the details about which drug or dosage. I need more information to prepare.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.7, "frustration": 0.25, "anger": 0.1, "disappointment": 0.15, "satisfaction": 0.0}, "id": "d8a34eb9-4d63-4947-9d61-5bbc8c790e04"}
{"text": "I had a CT scan scheduled for Monday, but I received a message that the equipment malfunctioned and the procedure needs to be rescheduled. The office said I'll be contacted by Wednesday, but I haven't heard back yet. I need to confirm the new date.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.85, "confusion": 0.65, "frustration": 0.35, "anger": 0.15, "disappointment": 0.25, "satisfaction": 0.0}, "id": "b66b3684-36b1-44b1-b9cb-4dc2ff4e60d9"}
{"text": "I've been experiencing persistent lower back pain for over three weeks. Last month's X-rays showed no abnormalities, but the pain continues. I need to schedule another imaging test to rule out any structural issues.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.75, "confusion": 0.5, "frustration": 0.2, "anger": 0.05, "disappointment": 0.1, "satisfaction": 0.05}, "id": "1f3386af-12d1-4c3d-90fe-8858ffd12193"}
{"text": "I was supposed to get my lab results by today, but I haven't received them yet. The doctor's office said it might take a few days, but I'm not sure when exactly.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.65, "confusion": 0.35, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "65a0a439-9dad-4915-a295-b5c5d5f0661d"}
{"text": "The prescription I got last week for my hypertension hasn't been filled yet. I called the pharmacy and they said there was a system error, so I need to check with my insurance about a new prescription.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.5, "confusion": 0.4, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "54cb0d11-094b-4cda-84fe-48cf37e24905"}
{"text": "I've been having persistent headaches for about three weeks now. I went to urgent care twice, but they couldn't find anything wrong. Should I get a CT scan done?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.2, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "b9a62345-8638-49ae-a4fc-9e2b699e7ea3"}
{"text": "My HbA1c test came back with a value of 7.8, which is higher than my target. The clinic said I might need to adjust my medication. I'm not sure what that means for my diabetes management.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.55, "confusion": 0.3, "frustration": 0.15, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "a2465f02-5105-4a83-8508-4d164cddbbd0"}
{"text": "I need to schedule a follow-up appointment with Dr. Evans. I lost my copy of the referral, so I have to call his office to get a new one. Also, I want to ask about the side effects of the new medication he prescribed.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.4, "confusion": 0.45, "frustration": 0.15, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "bc7d674a-b7a0-4d4c-bfd5-b16940b3e639"}
{"text": "I called the lab yesterday to check my lipid panel results but they said they lost the report and haven't rescheduled. The doctor's office is closed until Monday so I can't get an update until then.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.65, "confusion": 0.3, "frustration": 0.2, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "d2bd35b4-88ee-4ba5-98ff-abf696489acd"}
{"text": "My prescription for metformin was refilled automatically last month but I haven't received the mail. I called the pharmacy this morning and they said it's on backorder. Will that affect my diabetes management?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.5, "confusion": 0.4, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "709db8af-578e-4889-b09c-aae9b2d34b4e"}
{"text": "I'm trying to schedule a follow-up with Dr. Reynolds for my hypertension. The online portal keeps crashing when I try to book, so I called the front desk. They said the next available time is June 15th.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.3, "confusion": 0.4, "frustration": 0.2, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "15a27e08-1a47-412e-ba38-41a900a751a5"}
{"text": "The hospital sent me a bill for a CT scan I had last year, but I thought it was covered by my insurance. I called their billing department and they said I need to verify my coverage with my provider. Where can I find this information?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.4, "confusion": 0.5, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "9d5f613c-c6b3-4b60-b41a-a6c89eee2c34"}
{"text": "My blood pressure has been elevated for three months despite taking lisinopril. The clinic ordered a renal ultrasound and stress test, but I haven't received the results in two weeks. Should I go to the ER?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.3, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "e18fb4e9-e15c-41e3-8086-103ae754bf5a"}
{"text": "I called the lab yesterday to check my test results for cholesterol and they said they are reviewing them. When will I get them back? I'm due for my follow-up appointment in two weeks, but I want to make sure I have the results before then.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.85, "confusion": 0.15, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "fccf753a-de18-447a-a880-2561fc3499f7"}
{"text": "I tried to refill my prescription online but the system said there's an error. I called the pharmacy this morning and they couldn't resolve it. Can someone help me get this filled today? My doctor's orders say it's urgent.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.3, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "33e44956-1adb-4125-86b8-076fe68a66e5"}
{"text": "My appointment for next Monday at 2 PM is confirmed, but the email didn't include the building address or room number. The website also doesn't have it listed. How can I get this information before I go?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.6, "confusion": 0.4, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "53b1a014-c6cc-4cfc-a222-f08a6b1d2501"}
{"text": "I had my CT scan results sent to my primary care doctor. They called and said the images were unclear and need to be rescheduled. I called the radiology center and they said I can go back in three weeks. Is that reasonable? What do I need to do before the repeat scan?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.9, "confusion": 0.1, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "5722bbc0-cb05-4213-b4fe-105a3b888319"}
{"text": "I received my bill and noticed a charge for a blood test I didn't have done. I called the billing office and they said it was an automatic charge from the lab. I asked to have it removed but they said I need to contact them by Friday. Can you explain why this was charged and how I can get it corrected?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.5, "confusion": 0.5, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "495489c8-5149-4a96-a1a8-e459889271e6"}
{"text": "I have been experiencing persistent headaches for about two weeks. Last Friday I had a CT scan which showed nothing abnormal. My primary care physician recommended I see a neurologist for further evaluation. I called the clinic today but all appointments are booked until next month. Should I wait or consider another facility?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.4, "frustration": 0.2, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "27ed2b35-d459-4f49-87cf-e245eff377c9"}
{"text": "I received my lab results yesterday and noticed the cholesterol level is higher than expected. The report states it's borderline high but doesn't specify if there are any immediate risks. I'm currently on a statin medication. What additional steps should I take based on these numbers?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.7, "confusion": 0.3, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "57759cc6-25a1-4de7-a0eb-24cef83d9200"}
{"text": "My insurance claim for a recent physical therapy session was denied. The reason given is insufficient documentation. I submitted all required forms and receipts. Could you help me understand what documentation might be missing or incomplete?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.1, "confusion": 0.7, "frustration": 0.5, "anger": 0.0, "disappointment": 0.3, "satisfaction": 0.0}, "id": "80617012-b86b-4eac-92e6-6c4e694cad13"}
{"text": "I need to schedule an appointment for a follow-up after my gallbladder surgery. The surgeon's office requires a referral letter from my primary care doctor. I don't have that letter yet. When will it be available, and do I need to contact my PCP to expedite this?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.2, "confusion": 0.6, "frustration": 0.3, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "45d7b5a6-58ba-4c1e-aad5-707973ac31e9"}
{"text": "My glucose readings have been fluctuating significantly since starting the new insulin regimen. Last month's A1c was 7.2%, now it's 8.1%. I'm unsure if this is normal variation or if adjustments are needed. Could you advise on the next steps for managing my diabetes?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.6, "confusion": 0.5, "frustration": 0.2, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "b917a516-6c96-4525-a1f1-4ceada4a7eed"}
{"text": "I submitted my diabetes test results yesterday but haven't received feedback yet. What is the typical turnaround time for lab reports? My appointment with Dr. Miller is next week so I need to know my results before then.", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.2, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "67a7a316-289b-450c-a607-d8406d85dae2"}
{"text": "I'm having persistent knee pain after my sports injury. The initial X-ray was normal but the orthopedist recommended an MRI. When will I get the MRI results and what do I need to do to schedule it?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.75, "confusion": 0.3, "frustration": 0.05, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "2c157d5c-0dfa-4272-897b-1fd908b05b9b"}
{"text": "My insurance claim for the physical therapy session this week hasn't been processed. I need to submit copies of my referral letter again. Can you confirm if there's any additional documentation required?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.1, "confusion": 0.4, "frustration": 0.3, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "2eceb7fe-9a85-4fbe-b568-9d4d5b27a684"}
{"text": "I forgot my Medicare card at home and need to access the patient portal for a refill request. How can I proceed without my ID? I called the office but they're closed until Monday.", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.2, "confusion": 0.5, "frustration": 0.2, "anger": 0.0, "disappointment": 0.1, "satisfaction": 0.0}, "id": "5c6bae10-ea1a-4faf-832b-553d17858ee5"}
{"text": "My blood pressure reading at the clinic was 160/95. The doctor mentioned starting medication but I need clarification on dosage and potential side effects. When can I expect to see improvement with treatment?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.9, "confusion": 0.3, "frustration": 0.05, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "bf4482b5-d2d3-408c-9d96-1069402d1b76"}
{"text": "I have an appointment scheduled for tomorrow at 10:30 AM with Dr. Smith at the Downtown Clinic. I just noticed my insurance co-pay is missing from the email confirmation. Should I pay it now or wait for the paper statement?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.75, "confusion": 0.6, "frustration": 0.1, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "b90e808e-1d9e-4c0a-9a7c-be13af782207"}
{"text": "My recent blood test results show an elevated white blood cell count. The doctor said it might be due to an infection, but I don't have any symptoms. Could this be something else, or should I wait for the follow-up appointment next week?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.8, "confusion": 0.5, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "d1be02f3-9b76-4124-82fd-414f3f6b5655"}
{"text": "I'm trying to access my lab results through the patient portal but keep getting a login error. The website says 'invalid credentials' even though I'm sure I'm entering the correct username and password. Has there been any system maintenance recently?", "domain": "administrative", "language": "en", "emotions": {"anxiety": 0.55, "confusion": 0.7, "frustration": 0.3, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "6669d274-227b-4876-ae45-1e468df46acc"}
{"text": "The prescribed pain medication for my back injury has caused increased drowsiness than expected. The dosage is 500mg twice daily, but I'm still having difficulty sleeping at night. Should I consider adjusting the timing or the dose before the next visit?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.65, "confusion": 0.45, "frustration": 0.2, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "c81f82e0-11db-4ce8-913e-026f33933299"}
{"text": "My biopsy results for the suspicious mole are back, and the pathology report indicates atypical hyperplasia. The dermatologist mentioned monitoring it but I need clarification on the follow-up schedule. When should the next check-up be scheduled?", "domain": "clinical", "language": "en", "emotions": {"anxiety": 0.9, "confusion": 0.4, "frustration": 0.0, "anger": 0.0, "disappointment": 0.0, "satisfaction": 0.0}, "id": "b40b48c1-d18b-4510-94bd-e7dab3ef54cb"}
